export const DATA = [
  {
    question: 'Вопрос №1: Какие действия при дорожно-транспортном происшествии должны немедленно осуществить водители, причастные к нему?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Освободить проезжую часть.',
        correct: false,
      },
      {
        id: '2',
        value: 'Остановить (не трогать с места) транспортное средство, включить аварийную сигнализацию и выставить знак аварийной остановки.',
        correct: true,
      },
      {
        id: '3',
        value: 'Сообщить о случившемся в полицию.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: В чем особенность скоростного режима на этом участке дороги?',
    link: './img/8-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Рекомендуемая скорость движения - 40 км/ч.',
        correct: false,
      },
      {
        id: '5',
        value: 'Минимальная допустимая скорость движения - 40 км/ч.',
        correct: false,
      },
      {
        id: '6',
        value: 'Минимальная допустимая скорость движения по левой полосе - 40 км/ч.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №3: Какие из указанных знаков запрещают поворот налево?',
    link: './img/8-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '8',
        value: 'А и Б.',
        correct: false,
      },
      {
        id: '9',
        value: 'А и В.',
        correct: true,
      },
      {
        id: '10',
        value: 'Все.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Можно ли Вам повернуть направо на этом перекрестке?',
    link: './img/8-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '12',
        value: 'Можно, если Вы проживаете или работаете на территории, расположенной справа от перекрестка.',
        correct: false,
      },
      {
        id: '13',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Разрешается ли Вам перестроиться?',
    link: './img/8-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Разрешается только на соседнюю полосу.',
        correct: true,
      },
      {
        id: '15',
        value: 'Разрешается, если скорость грузового автомобиля менее 30 км/ч.',
        correct: false,
      },
      {
        id: '16',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Разрешено ли Вам движение?',
    link: './img/8-6.jpg',
    answer: [
      {
        id: '17',
        value: 'Разрешено только направо.',
        correct: false,
      },
      {
        id: '18',
        value: 'Разрешено только для выполнения разворота.',
        correct: false,
      },
      {
        id: '19',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №7: Водитель легкового автомобиля должен выключить указатели левого поворота:',
    link: './img/8-7.jpg',
    answer: [
      {
        id: '20',
        value: 'После перестроения на левую полосу.',
        correct: true,
      },
      {
        id: '21',
        value: 'После опережения грузового автомобиля.',
        correct: false,
      },
      {
        id: '22',
        value: 'После возвращения на правую полосу.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: По какой траектории Вам разрешается выполнить поворот налево?',
    link: './img/8-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Только по А.',
        correct: false,
      },
      {
        id: '24',
        value: 'Только по Б.',
        correct: true,
      },
      {
        id: '25',
        value: 'По любой из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Вы имеете право выполнить разворот:',
    link: './img/8-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Только по траектории А.',
        correct: false,
      },
      {
        id: '27',
        value: 'Только по траектории Б.',
        correct: false,
      },
      {
        id: '28',
        value: 'По любой траектории из указанных.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: Вне населенных пунктов Вам можно продолжить движение:',
    link: './img/8-10.jpg',
    answer: [
      {
        id: '29',
        value: 'По любой полосе.',
        correct: false,
      },
      {
        id: '30',
        value: 'По правой или средней полосе.',
        correct: false,
      },
      {
        id: '31',
        value: 'Только по правой полосе.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешено ли Вам после опережения первого автомобиля продолжить движение по левой полосе вне населенных пунктов?',
    link: './img/8-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '33',
        value: 'Разрешено, если Вы намерены опередить второй автомобиль.',
        correct: true,
      },
      {
        id: '34',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Нарушил ли водитель грузового автомобиля правила стоянки?',
    link: './img/8-12.jpg',
    answer: [
      {
        id: '35',
        value: 'Нарушил.',
        correct: true,
      },
      {
        id: '36',
        value: 'Нарушил, если разрешенная максимальная масса автомобиля более 2,5 т.',
        correct: false,
      },
      {
        id: '37',
        value: 'Не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Кто из водителей, выполняющих поворот, нарушит Правила?',
    link: './img/8-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Оба.',
        correct: true,
      },
      {
        id: '39',
        value: 'Только водитель легкового автомобиля.',
        correct: false,
      },
      {
        id: '40',
        value: 'Только водитель мотоцикла.',
        correct: false,
      },
      {
        id: '41',
        value: 'Никто не нарушит.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены продолжить движение в прямом направлении. Ваши действия?',
    link: './img/8-14.jpg',
    answer: [
      {
        id: '42',
        value: 'Проедете перекресток первым.',
        correct: false,
      },
      {
        id: '43',
        value: 'Уступите дорогу легковому автомобилю.',
        correct: true,
      },
      {
        id: '44',
        value: 'Уступите дорогу легковому автомобилю и мотоциклу.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы должны уступить дорогу при повороте налево?',
    link: './img/8-15.jpg',
    answer: [
      {
        id: '45',
        value: 'Только трамваям.',
        correct: false,
      },
      {
        id: '46',
        value: 'Трамваю Б и легковому автомобилю.',
        correct: true,
      },
      {
        id: '47',
        value: 'Всем транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Остановка на автомагистрали разрешена:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '48',
        value: 'В любых местах за пределами проезжей части.',
        correct: false,
      },
      {
        id: '49',
        value: 'Только правее линии разметки, обозначающей край проезжей части.',
        correct: false,
      },
      {
        id: '50',
        value: 'Только на специальных площадках для стоянки, обозначенных соответствующими знаками.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: Какие внешние световые приборы должны использоваться при движении в темное время суток на освещенных участках дорог населенного пункта?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '51',
        value: 'Только габаритные огни.',
        correct: false,
      },
      {
        id: '52',
        value: 'Фары ближнего света.',
        correct: true,
      },
      {
        id: '53',
        value: 'Габаритные огни или фары ближнего света',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: При возникновении какой неисправности запрещается дальнейшее движение транспортного средства даже до места ремонта или стоянки?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '54',
        value: 'Неисправна рабочая тормозная система.',
        correct: true,
      },
      {
        id: '55',
        value: 'Неисправна система выпуска отработавших газов.',
        correct: false,
      },
      {
        id: '56',
        value: 'Не работает стеклоомыватель.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Более устойчив против опрокидывания на повороте легковой автомобиль:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '57',
        value: 'Без пассажиров и груза.',
        correct: true,
      },
      {
        id: '58',
        value: 'Без пассажиров, но с грузом на верхнем багажнике.',
        correct: true,
      },
      {
        id: '59',
        value: 'С пассажирами, но без груза.',
        correct: false,
      },
      {
        id: '60',
        value: 'С пассажирами и грузом.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Как оказать первую помощь при отморожении и переохлаждении?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '61',
        value: 'Растереть пораженные участки тела снегом или шерстью, затем их утеплить, дать алкоголь, переместить в теплое помещение.',
        correct: false,
      },
      {
        id: '62',
        value: 'Утеплить пораженные участки тела и обездвижить их, укутать пострадавшего теплой одеждой или пледом, дать теплое питье, переместить в теплое помещение.',
        correct: true,
      },
      {
        id: '63',
        value: 'Смазать пораженные участки тела кремом, наложить согревающий компресс и грелку, переместить в теплое помещение, дать теплое питье.',
        correct: false,
      },
    ]
  },
]

export default DATA;