export const DATA = [
  {
    question: 'Вопрос №1: Сколько полос для движения имеет данная дорога?',
    link: './img/2-1.jpg',
    answer: [
      {
        id: '1',
        value: 'Две.',
        correct: false,
      },
      {
        id: '2',
        value: 'Четыре.',
        correct: true,
      },
      {
        id: '3',
        value: 'Пять.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Можно ли Вам въехать на мост первым?',
    link: './img/2-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '5',
        value: 'Можно, если Вы не затрудните движение встречному автомобилю.',
        correct: false,
      },
      {
        id: '6',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Разрешено ли Вам произвести остановку для посадки пассажира?',
    link: './img/2-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Разрешено.',
        correct: true,
      },
      {
        id: '8',
        value: 'Разрешено только по четным числам месяца.',
        correct: false,
      },
      {
        id: '9',
        value: 'Разрешено только по нечетным числам месяца.',
        correct: false,
      },
      {
        id: '10',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Что запрещено в зоне действия этого знака?',
    link: './img/2-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Движение любых транспортных средств.',
        correct: false,
      },
      {
        id: '12',
        value: 'Движение всех транспортных средств со скоростью не более 20 км/ч.',
        correct: false,
      },
      {
        id: '13',
        value: 'Движение механических транспортных средств.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Разрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?',
    link: './img/2-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Разрешен.',
        correct: false,
      },
      {
        id: '15',
        value: 'Разрешен, если скорость автобуса менее 30 км/ч.',
        correct: false,
      },
      {
        id: '16',
        value: 'Запрещен.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Информационная световая секция в виде силуэта пешехода и стрелки с мигающим сигналом бело-лунного цвета, расположенная под светофором, информирует водителя о том, что:',
    link: './img/2-6.jpg',
    answer: [
      {
        id: '17',
        value: 'На пешеходном переходе, в направлении которого он поворачивает, включен сигнал светофора, разрешающий движение пешеходам.',
        correct: true,
      },
      {
        id: '18',
        value: 'На пешеходном переходе, в направлении которого он поворачивает, включен сигнал светофора, запрещающий движение пешеходам.',
        correct: false,
      },
      {
        id: '19',
        value: 'Он поворачивает в направлении пешеходного перехода.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Поднятая вверх рука водителя легкового автомобиля является сигналом, информирующим Вас о его намерении:',
    link: './img/2-7.jpg',
    answer: [
      {
        id: '20',
        value: 'Повернуть направо.',
        correct: false,
      },
      {
        id: '21',
        value: 'Продолжить движение прямо.',
        correct: false,
      },
      {
        id: '22',
        value: 'Снизить скорость, чтобы остановиться и уступить дорогу мотоциклу.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Двигаясь по левой полосе, водитель намерен перестроиться на правую. На каком из рисунков показана ситуация, в которой он обязан уступить дорогу?',
    link: './img/2-8.jpg',
    answer: [
      {
        id: '23',
        value: 'На левом.',
        correct: false,
      },
      {
        id: '24',
        value: 'На правом.',
        correct: false,
      },
      {
        id: '25',
        value: 'На обоих.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Можно ли Вам выполнить разворот в этом месте?',
    link: './img/2-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '27',
        value: 'Можно только при отсутствии приближающегося поезда.',
        correct: false,
      },
      {
        id: '28',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: В каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '29',
        value: 'Только если на дороге нет других транспортных средств.',
        correct: false,
      },
      {
        id: '30',
        value: 'Только при движении в темное время суток.',
        correct: false,
      },
      {
        id: '31',
        value: 'Только при перестроении.',
        correct: true,
      },
      {
        id: '32',
        value: 'Во всех перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешено ли Вам обогнать мотоцикл?',
    link: './img/2-11.jpg',
    answer: [
      {
        id: '33',
        value: 'Разрешено.',
        correct: true,
      },
      {
        id: '34',
        value: 'Разрешено, если водитель мотоцикла снизил скорость.',
        correct: false,
      },
      {
        id: '35',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?',
    link: './img/2-12.jpg',
    answer: [
      {
        id: '36',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '37',
        value: 'Только если расстояние до края пересекаемой проезжей части не менее 5 м.',
        correct: true,
      },
      {
        id: '38',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены повернуть налево. Кому Вы должны уступить дорогу?',
    link: './img/2-13.jpg',
    answer: [
      {
        id: '39',
        value: 'Только пешеходам.',
        correct: false,
      },
      {
        id: '40',
        value: 'Только автобусу.',
        correct: false,
      },
      {
        id: '41',
        value: 'Автобусу и пешеходам.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №14: В каком случае Вы имеете преимущество?',
    link: './img/2-14.jpg',
    answer: [
      {
        id: '44',
        value: 'Только при повороте направо.',
        correct: false,
      },
      {
        id: '45',
        value: 'Только при повороте налево.',
        correct: false,
      },
      {
        id: '46',
        value: 'В обоих перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15:Обязан ли водитель мотоцикла уступить Вам дорогу?',
    link: './img/2-15.jpg',
    answer: [
      {
        id: '47',
        value: 'Обязан.',
        correct: true,
      },
      {
        id: '48',
        value: 'не обязан.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешается ли водителю выполнить объезд грузового автомобиля?',
    link: './img/2-16.jpg',
    answer: [
      {
        id: '49',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '50',
        value: 'Разрешается, если между шлагбаумом и остановившимся грузовым автомобилем расстояние более 5 м.',
        correct: false,
      },
      {
        id: '51',
        value: 'Запрещается.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: В каких из перечисленных случаев запрещена буксировка на гибкой сцепке?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '52',
        value: 'Только на горных дорогах.',
        correct: false,
      },
      {
        id: '53',
        value: 'Только в гололедицу.',
        correct: true,
      },
      {
        id: '54',
        value: 'Только в темное время суток и в условиях недостаточной видимости.',
        correct: false,
      },
      {
        id: '55',
        value: 'Во всех перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: Запрещается эксплуатация мототранспортных средств (категории L), если остаточная глубина рисунка протектора шин (при отсутствии индикаторов износа) составляет не более:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '56',
        value: '0,8 мм.',
        correct: true,
      },
      {
        id: '57',
        value: '1,0 мм.',
        correct: false,
      },
      {
        id: '58',
        value: '1,6 мм.',
        correct: false,
      },
      {
        id: '59',
        value: '2,0 мм.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Исключает ли антиблокировочная тормозная система возможность возникновения заноса или сноса при прохождении поворота?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '60',
        value: 'Полностью исключает возможность возникновения только заноса.',
        correct: false,
      },
      {
        id: '61',
        value: 'Полностью исключает возможность возникновения только сноса.',
        correct: false,
      },
      {
        id: '62',
        value: 'Не исключает возможность возникновения сноса или заноса.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №20: В каких случаях следует начинать сердечно-легочную реанимацию пострадавшего?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '63',
        value: 'При наличии болей в области сердца и затрудненного дыхания.',
        correct: false,
      },
      {
        id: '64',
        value: 'При отсутствии у пострадавшего сознания, независимо от наличия дыхания.',
        correct: false,
      },
      {
        id: '65',
        value: 'При отсутствии у пострадавшего сознания, дыхания и кровообращения.',
        correct: true,
      },
    ]
  },
]

export default DATA;