export const DATA = [
  {
    question: 'Вопрос №1: При наличии каких условий в случаях вынужденной остановки транспортного средства или дорожно-транспортного происшествия водитель обязан быть одетым в куртку, жилет или жилет-накидку с полосами световозвращающего материала?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Если это произошло вне населенных пунктов.',
        correct: false,
      },
      {
        id: '2',
        value: 'Если это произошло в темное время суток либо в условиях ограниченной видимости.',
        correct: false,
      },
      {
        id: '3',
        value: 'Если водитель находится на проезжей части или обочине.',
        correct: false,
      },
      {
        id: '4',
        value: 'При наличии всех перечисленных условий.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №2: В какой из дворов Вам можно въехать в данной ситуации?',
    link: './img/16-2.jpg',
    answer: [
      {
        id: '5',
        value: 'Повороты во дворы запрещены.',
        correct: false,
      },
      {
        id: '6',
        value: 'Только во двор направо.',
        correct: true,
      },
      {
        id: '7',
        value: 'Только во двор налево.',
        correct: false,
      },
      {
        id: '8',
        value: 'В любой.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Какой из указанных знаков запрещает дальнейшее движение всех без исключения транспортных средств?',
    link: './img/16-3.jpg',
    answer: [
      {
        id: '9',
        value: 'А.',
        correct: false,
      },
      {
        id: '10',
        value: 'Б.',
        correct: true,
      },
      {
        id: '11',
        value: 'В.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: О чем информируют эти знаки?',
    link: './img/16-4.jpg',
    answer: [
      {
        id: '12',
        value: 'Разрешенная скорость не более 40 км/ч при влажном покрытии.',
        correct: false,
      },
      {
        id: '13',
        value: 'Рекомендуемая скорость 40 км/ч при влажном покрытии.',
        correct: true,
      },
      {
        id: '14',
        value: 'Рекомендуемая скорость не более 40 км/ч только во время дождя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Разрешена ли Вам остановка в этом месте?',
    link: './img/16-5.jpg',
    answer: [
      {
        id: '15',
        value: 'Разрешена.',
        correct: false,
      },
      {
        id: '16',
        value: 'Разрешена без заезда на тротуар.',
        correct: false,
      },
      {
        id: '17',
        value: 'Запрещена.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Как следует поступить водителю при переключении такого сигнала светофора?',
    link: './img/16-6.jpg',
    answer: [
      {
        id: '18',
        value: 'При включении красного сигнала повернуть направо, уступая дорогу другим участникам движения.',
        correct: false,
      },
      {
        id: '19',
        value: 'При включении зеленого сигнала продолжить движение только направо.',
        correct: true,
      },
      {
        id: '20',
        value: 'Указанные действия являются правильными в обоих случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Аварийная сигнализация на буксируемом механическом транспортном средстве должна быть включена:',
    link: './img/16-7.jpg',
    answer: [
      {
        id: '21',
        value: 'Только в условиях недостаточной видимости.',
        correct: false,
      },
      {
        id: '22',
        value: 'Только в темное время суток.',
        correct: false,
      },
      {
        id: '23',
        value: 'Во всех случаях, когда осуществляется буксировка.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №8: Обязан ли водитель автомобиля, который движется по левой полосе, уступить дорогу в данной ситуации?',
    link: './img/16-8.jpg',
    answer: [
      {
        id: '24',
        value: '',
        correct: false,
      },
      {
        id: '25',
        value: '',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Можно ли Вам на перекрестке выполнить разворот, двигаясь задним ходом?',
    link: './img/16-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '26',
        value: 'Можно, если при этом не будут созданы помехи другим участникам движения.',
        correct: false,
      },
      {
        id: '27',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой максимальной скоростью Вы имеете право продолжить движение вне населенных пунктов на легковом автомобиле?',
    link: './img/16-10.jpg',
    answer: [
      {
        id: '28',
        value: '60 км/ч.',
        correct: false,
      },
      {
        id: '29',
        value: '90 км/ч.',
        correct: true,
      },
      {
        id: '30',
        value: '110 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешается ли Вам выполнить обгон в данной ситуации?',
    link: './img/16-11.jpg',
    answer: [
      {
        id: '31',
        value: 'Разрешается.',
        correct: true,
      },
      {
        id: '32',
        value: 'Разрешается, только если скорость трактора менее 30 км/ч.',
        correct: false,
      },
      {
        id: '33',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: В каком из указанных мест Вы можете поставить автомобиль на стоянку?',
    link: './img/16-12.jpg',
    answer: [
      {
        id: '34',
        value: 'Только В.',
        correct: true,
      },
      {
        id: '35',
        value: 'Б или В.',
        correct: false,
      },
      {
        id: '36',
        value: 'В любом.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?',
    link: './img/16-13.jpg',
    answer: [
      {
        id: '37',
        value: 'Трамваю и автомобилю.',
        correct: false,
      },
      {
        id: '38',
        value: 'Только трамваю.',
        correct: true,
      },
      {
        id: '39',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: При въезде на перекресток Вы:',
    link: './img/16-14.jpg',
    answer: [
      {
        id: '40',
        value: 'Должны уступить дорогу обоим транспортным средствам.',
        correct: true,
      },
      {
        id: '41',
        value: 'Должны уступить дорогу только автомобилю.',
        correct: false,
      },
      {
        id: '42',
        value: 'Имеете преимущество перед обоими транспортными средствами.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы обязаны уступить дорогу при повороте налево?',
    link: './img/16-15.jpg',
    answer: [
      {
        id: '43',
        value: 'Только автобусу.',
        correct: false,
      },
      {
        id: '44',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '45',
        value: 'Обоим транспортным средствам.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешено ли Вам остановиться на автомагистрали правее линии, обозначающей край проезжей части?',
    link: './img/16-16.jpg',
    answer: [
      {
        id: '46',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '47',
        value: 'Разрешено только в случае вынужденной остановки.',
        correct: true,
      },
      {
        id: '48',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: Какие из перечисленных требований являются обязательными при перевозке детей?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '48',
        value: 'Перевозка детей в возрасте до 11 лет (включительно) на переднем сиденье легкового автомобиля должна осуществляться только с использованием соответствующих детских удерживающих систем (устройств).',
        correct: false,
      },
      {
        id: '49',
        value: 'Запрещается перевозка детей в возрасте младше 12 лет на заднем сиденье мотоцикла.',
        correct: false,
      },
      {
        id: '50',
        value: 'Оба требования являются обязательными.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: Запрещается эксплуатация легкового автомобиля, если стояночная тормозная система не обеспечивает неподвижное состояние автомобиля в снаряженном состоянии на уклоне:',
    link: './img/16-18.jpg',
    answer: [
      {
        id: '51',
        value: 'До 16% включительно.',
        correct: false,
      },
      {
        id: '52',
        value: 'До 23% включительно.',
        correct: true,
      },
      {
        id: '53',
        value: 'До 31% включительно.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: При повороте направо обеспечение безопасности движения достигается путем выполнения поворота по траектории, которая показана:',
    link: './img/16-19.jpg',
    answer: [
      {
        id: '54',
        value: 'На левом рисунке.',
        correct: true,
      },
      {
        id: '55',
        value: 'На правом рисунке.',
        correct: false,
      },
      {
        id: '56',
        value: 'На обоих рисунках.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Как определить наличие дыхания у потерявшего сознание пострадавшего?',
    link: './img/16-1.jpg',
    answer: [
      {
        id: '57',
        value: 'Взять пострадавшего за подбородок, запрокинуть голову и в течение 10 секунд проследить за движением его грудной клетки.',
        correct: false,
      },
      {
        id: '58',
        value: 'Положить одну руку на лоб пострадавшего, двумя пальцами другой поднять подбородок и, запрокинув голову, наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, постараться ощутить выдыхаемый воздух своей щекой, проследить за движением грудной клетки.',
        correct: true,
      },
      {
        id: '59',
        value: 'Не запрокидывая головы пострадавшего, наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, почувствовать его своей щекой, проследить за движением его грудной клетки.',
        correct: false,
      },
    ]
  },
]

export default DATA;