export const DATA = [
  {
    question: 'Вопрос №1: Что называется разрешенной максимальной массой транспортного средства?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Максимально допустимая для перевозки масса груза, установленная предприятием-изготовителем.',
        correct: false,
      },
      {
        id: '2',
        value: 'Масса снаряженного транспортного средства без учета массы водителя, пассажиров и груза, установленная предприятием-изготовителем.',
        correct: false,
      },
      {
        id: '3',
        value: 'Масса снаряженного транспортного средства с грузом, водителем и пассажирами, установленная предприятием-изготовителем в качестве максимально допустимой.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №2: Вам разрешено продолжить движение:',
    link: './img/6-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Только прямо.',
        correct: false,
      },
      {
        id: '5',
        value: 'Прямо или в обратном направлении.',
        correct: true,
      },
      {
        id: '6',
        value: 'Во всех направлениях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Какие из указанных знаков разрешают проезд на автомобиле к месту проживания или работы?',
    link: './img/6-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '8',
        value: 'Только В.',
        correct: false,
      },
      {
        id: '9',
        value: 'А и В.',
        correct: true,
      },
      {
        id: '10',
        value: 'Все.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Что обозначают эти дорожные знаки?',
    link: './img/6-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Парковочное место только для автобусов.',
        correct: false,
      },
      {
        id: '12',
        value: 'Парковочное место для автобусов и троллейбусов.',
        correct: false,
      },
      {
        id: '13',
        value: 'Парковочное место, где возможна пересадка на маршрутное транспортное средство (автобус или троллейбус).',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Разметка в виде треугольника на полосе движения:',
    link: './img/6-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Обозначает опасный участок дороги.',
        correct: false,
      },
      {
        id: '15',
        value: 'Предупреждает Вас о приближении к месту, где нужно уступить дорогу.',
        correct: true,
      },
      {
        id: '16',
        value: 'Указывает место, где Вам необходимо остановиться.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Разрешается ли продолжить движение, если регулировщик поднял руку вверх после того, как Вы въехали на перекресток?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '17',
        value: 'Разрешается.',
        correct: true,
      },
      {
        id: '18',
        value: 'Разрешается, если Вы поворачиваете направо.',
        correct: false,
      },
      {
        id: '19',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Вы намерены продолжить движение по главной дороге. Обязаны ли Вы включить указатели левого поворота?',
    link: './img/6-7.jpg',
    answer: [
      {
        id: '20',
        value: 'Обязаны.',
        correct: true,
      },
      {
        id: '21',
        value: 'Обязаны, если с других направлений приближаются транспортные средства.',
        correct: false,
      },
      {
        id: '22',
        value: 'Не обязаны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Кто должен уступить дорогу при взаимном перестроении?',
    link: './img/6-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Водитель легкового автомобиля.',
        correct: false,
      },
      {
        id: '24',
        value: 'Водитель грузового автомобиля.',
        correct: true,
      },
      {
        id: '25',
        value: 'Водителям следует действовать по взаимной договоренности.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: В каких направлениях Вам можно продолжить движение?',
    link: './img/6-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Только прямо.',
        correct: false,
      },
      {
        id: '27',
        value: 'Прямо и налево.',
        correct: false,
      },
      {
        id: '28',
        value: 'Прямо, налево и в обратном направлении.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?',
    link: './img/6-10.jpg',
    answer: [
      {
        id: '29',
        value: '70 км/ч.',
        correct: false,
      },
      {
        id: '30',
        value: '90 км/ч.',
        correct: false,
      },
      {
        id: '31',
        value: '110 км/ч.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №11: Как Вам следует поступить в данной ситуации?',
    link: './img/6-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Уступить дорогу встречному автомобилю.',
        correct: true,
      },
      {
        id: '33',
        value: 'Проехать первым.',
        correct: false,
      },
      {
        id: '34',
        value: 'Действовать по взаимной договоренности с водителем встречного автомобиля.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Разрешено ли Вам поставить автомобиль на стоянку в этом месте?',
    link: './img/6-12.jpg',
    answer: [
      {
        id: '35',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '36',
        value: 'Разрешено, если при этом не будут созданы помехи для движения маршрутных транспортных средств.',
        correct: false,
      },
      {
        id: '37',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены повернуть налево. Ваши действия?',
    link: './img/6-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Проедете перекресток первым.',
        correct: false,
      },
      {
        id: '39',
        value: 'Уступите дорогу трамваю, выполнив поворот с проезжей части.',
        correct: false,
      },
      {
        id: '40',
        value: 'Пропустите трамвай, перестроитесь на трамвайные пути попутного направления и выполните с них поворот.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №14: Кому Вы обязаны уступить дорогу при повороте налево?',
    link: './img/6-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Только пешеходам.',
        correct: false,
      },
      {
        id: '42',
        value: 'Пешеходам и велосипедисту.',
        correct: true,
      },
      {
        id: '43',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: В каком случае Вы должны будете уступить дорогу автомобилю ДПС?',
    link: './img/6-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Если на автомобиле ДПС будут включены проблесковые маячки синего цвета.',
        correct: false,
      },
      {
        id: '45',
        value: 'Если на автомобиле ДПС одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал.',
        correct: true,
      },
      {
        id: '46',
        value: 'В любом.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: При приближении к остановившемуся транспортному средству с включенной аварийной сигнализацией, которое имеет опознавательные знаки «Перевозка детей», водитель должен:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '47',
        value: 'Снизить скорость.',
        correct: false,
      },
      {
        id: '48',
        value: 'При необходимости остановиться и пропустить детей.',
        correct: false,
      },
      {
        id: '49',
        value: 'Осуществить все перечисленные действия.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: В каких случаях водители мопедов нарушают Правила?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '50',
        value: 'Только если управляют мопедом, не держась за руль хотя бы одной рукой.',
        correct: false,
      },
      {
        id: '51',
        value: 'Только если двигаются по дороге без застегнутого мотошлема.',
        correct: false,
      },
      {
        id: '52',
        value: 'В обоих перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: Эксплуатировать грузовой автомобиль с разрешенной максимальной массой не более 3,5 т можно при отсутствии:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '53',
        value: 'Аптечки.',
        correct: false,
      },
      {
        id: '54',
        value: 'Огнетушителя.',
        correct: false,
      },
      {
        id: '55',
        value: 'Знака аварийной остановки.',
        correct: false,
      },
      {
        id: '56',
        value: 'Противооткатных упоров.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: В случае остановки на подъеме (спуске) при наличии обочины можно предотвратить самопроизвольное скатывание автомобиля на проезжую часть, повернув его передние колеса в положение:',
    link: './img/6-19.jpg',
    answer: [
      {
        id: '57',
        value: 'А и Г.',
        correct: true,
      },
      {
        id: '58',
        value: 'Б и В.',
        correct: false,
      },
      {
        id: '59',
        value: 'А и В.',
        correct: false,
      },
      {
        id: '60',
        value: 'Б и Г.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Установленный факт употребления водителем вызывающих алкогольное опьянение веществ определяется наличием в его организме абсолютного этилового спирта в концентрации, превышающей:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '61',
        value: '0,10 миллиграмма на один литр выдыхаемого воздуха.',
        correct: false,
      },
      {
        id: '62',
        value: '0,16 миллиграмма на один литр выдыхаемого воздуха.',
        correct: true,
      },
      {
        id: '63',
        value: '0,25 миллиграмма на один литр выдыхаемого воздуха.',
        correct: false,
      },
    ]
  },
]

export default DATA;