export const DATA = [
  {
    question: 'Вопрос №1: Какой неподвижный объект, не позволяющий продолжить движение по полосе, не относится к понятию «Препятствие»?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Дефект проезжей части.',
        correct: false,
      },
      {
        id: '2',
        value: 'Посторонний предмет.',
        correct: false,
      },
      {
        id: '3',
        value: 'Неисправное или поврежденное транспортное средство.',
        correct: false,
      },
      {
        id: '4',
        value: 'Транспортное средство, остановившееся на этой полосе из-за образования затора.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №2: Вам можно продолжить движение на перекрестке:',
    link: './img/15-2.jpg',
    answer: [
      {
        id: '5',
        value: 'Только в направлении Б.',
        correct: false,
      },
      {
        id: '6',
        value: 'В направлениях А и Б.',
        correct: true,
      },
      {
        id: '7',
        value: 'В направлениях Б и В.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Этот дорожный знак:',
    link: './img/15-3.jpg',
    answer: [
      {
        id: '8',
        value: 'Рекомендует двигаться со скоростью 40 км/ч.',
        correct: false,
      },
      {
        id: '9',
        value: 'Требует двигаться со скоростью не менее 40 км/ч.',
        correct: false,
      },
      {
        id: '10',
        value: 'Запрещает движение со скоростью более 40 км/ч.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №4: Какие из указанных табличек указывают протяженность зоны действия знаков, с которыми они применяются?',
    link: './img/15-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '12',
        value: 'Только Б.',
        correct: false,
      },
      {
        id: '13',
        value: 'Б и В.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Разрешен ли Вам такой маневр при выключенных реверсивных светофорах?',
    link: './img/15-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Разрешен.',
        correct: false,
      },
      {
        id: '15',
        value: 'Разрешен, если нет встречных транспортных средств.',
        correct: false,
      },
      {
        id: '16',
        value: 'Разрешен только для обгона.',
        correct: false,
      },
      {
        id: '17',
        value: 'Запрещен.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: При таких сигналах светофора и жесте регулировщика Вы должны:',
    link: './img/15-6.jpg',
    answer: [
      {
        id: '18',
        value: 'Остановиться у стоп-линии.',
        correct: true,
      },
      {
        id: '19',
        value: 'Продолжить движение только прямо.',
        correct: false,
      },
      {
        id: '20',
        value: 'Продолжить движение прямо или направо.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Обязан ли в этой ситуации водитель, остановившийся из-за неисправности, выставить знак аварийной остановки?',
    link: './img/15-7.jpg',
    answer: [
      {
        id: '21',
        value: 'Обязан.',
        correct: true,
      },
      {
        id: '22',
        value: 'Обязан, если неисправна аварийная сигнализация.',
        correct: false,
      },
      {
        id: '23',
        value: 'Не обязан.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: По какой траектории Вам разрешено продолжить движение налево?',
    link: './img/15-8.jpg',
    answer: [
      {
        id: '24',
        value: 'Только по А.',
        correct: false,
      },
      {
        id: '25',
        value: 'Только по Б.',
        correct: false,
      },
      {
        id: '26',
        value: 'По любой из указанных.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Как Вам следует действовать, выезжая с места стоянки одновременно с другим автомобилем?',
    link: './img/15-9.jpg',
    answer: [
      {
        id: '27',
        value: 'Уступить дорогу.',
        correct: true,
      },
      {
        id: '28',
        value: 'Проехать первым.',
        correct: false,
      },
      {
        id: '29',
        value: 'По взаимной договоренности с водителем этого автомобиля.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: К резкому торможению можно прибегнуть:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '30',
        value: 'Для остановки перед перекрестком или пешеходным переходом, когда зеленый сигнал светофора сменился на желтый.',
        correct: false,
      },
      {
        id: '31',
        value: 'Для предотвращения дорожно-транспортного происшествия.',
        correct: true,
      },
      {
        id: '32',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешается ли на двухполосной дороге выполнять обгон на перекрестках?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '33',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '34',
        value: 'Разрешается только на нерегулируемых перекрестках.',
        correct: false,
      },
      {
        id: '35',
        value: 'Разрешается только на перекрестках неравнозначных дорог при движении по главной дороге.',
        correct: true,
      },
      {
        id: '36',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Кто из водителей нарушил правила остановки?',
    link: './img/15-12.jpg',
    answer: [
      {
        id: '37',
        value: 'Оба.',
        correct: true,
      },
      {
        id: '38',
        value: 'Только водитель автомобиля.',
        correct: false,
      },
      {
        id: '39',
        value: 'Только водитель мотоцикла.',
        correct: false,
      },
      {
        id: '40',
        value: 'Никто не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: В каком случае Вы обязаны уступить дорогу трамваю?',
    link: './img/15-13.jpg',
    answer: [
      {
        id: '41',
        value: 'При повороте налево.',
        correct: false,
      },
      {
        id: '42',
        value: 'При движении прямо.',
        correct: false,
      },
      {
        id: '43',
        value: 'В обоих перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №14: При движении в прямом направлении Вам следует:',
    link: './img/15-14.jpg',
    answer: [
      {
        id: '44',
        value: 'Проехать перекресток первым.',
        correct: false,
      },
      {
        id: '45',
        value: 'Уступить дорогу только трамваю.',
        correct: true,
      },
      {
        id: '46',
        value: 'Уступить дорогу трамваю и легковому автомобилю.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы должны уступить дорогу при повороте налево?',
    link: './img/15-15.jpg',
    answer: [
      {
        id: '47',
        value: 'Только автобусу.',
        correct: true,
      },
      {
        id: '48',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '49',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Вам разрешено продолжить движение:',
    link: './img/15-16.jpg',
    answer: [
      {
        id: '50',
        value: 'Только по траектории А.',
        correct: false,
      },
      {
        id: '51',
        value: 'Только по траектории Б.',
        correct: true,
      },
      {
        id: '52',
        value: 'По траекториям А или Б.',
        correct: false,
      },
      {
        id: '53',
        value: 'По траекториям Б или В.',
        correct: false,
      },
      {
        id: '54',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: Привлечь внимание водителя обгоняемого автомобиля при движении вне населенного пункта в светлое время суток можно:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '55',
        value: 'Только подачей звукового сигнала.',
        correct: false,
      },
      {
        id: '56',
        value: 'Только кратковременным переключением фар с ближнего света на дальний.',
        correct: false,
      },
      {
        id: '57',
        value: 'Только совместной подачей указанных сигналов.',
        correct: false,
      },
      {
        id: '58',
        value: 'Любым из перечисленных способов.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: Эксплуатация мотоцикла запрещается:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '59',
        value: 'Только при отсутствии предусмотренных конструкцией подножек, поперечных рукояток для пассажиров на седле.',
        correct: false,
      },
      {
        id: '60',
        value: 'Только при отсутствии предусмотренных конструкцией дуг безопасности.',
        correct: false,
      },
      {
        id: '61',
        value: 'При отсутствии всего перечисленного оборудования.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: Как следует выбирать передачу при торможении двигателем с учетом крутизны спуска?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '62',
        value: 'Чем круче спуск, тем выше передача.',
        correct: false,
      },
      {
        id: '63',
        value: 'Чем круче спуск, тем ниже передача.',
        correct: true,
      },
      {
        id: '64',
        value: 'Выбор передачи не зависит от крутизны спуска.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: О каких травмах у пострадавшего может свидетельствовать поза «лягушки» (ноги согнуты в коленях и разведены, а стопы развернуты подошвами друг к другу) и какую первую помощь необходимо при этом оказать?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '65',
        value: 'У пострадавшего могут быть ушиб брюшной стенки, перелом лодыжки, перелом костей стопы. При первой помощи вытянуть ноги, наложить шины на обе ноги от голеностопного сустава до подмышки.',
        correct: false,
      },
      {
        id: '66',
        value: 'У пострадавшего могут быть переломы шейки бедра, костей таза, перелом позвоночника, повреждение внутренних органов малого таза, внутреннее кровотечение. Позу ему не менять, ноги не вытягивать, шины не накладывать. При первой помощи подложить под колени валик из мягкой ткани, к животу по возможности приложить холод.',
        correct: true,
      },
      {
        id: '67',
        value: 'У пострадавшего могут быть переломы костей голени и нижней трети бедра. При первой помощи наложить шины только на травмированную ногу от голеностопного до коленного сустава, не вытягивая ногу.',
        correct: false,
      },
    ]
  },
]

export default DATA;