export const DATA = [
  {
    question: 'Вопрос №1: Какие транспортные средства относятся к маршрутным транспортным средствам?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Автобусы (в том числе школьные).',
        correct: false,
      },
      {
        id: '2',
        value: 'Автобусы, троллейбусы и трамваи, используемые при осуществлении регулярных перевозок пассажиров и багажа, движущиеся по установленному маршруту с обозначенными местами остановок.',
        correct: true,
      },
      {
        id: '3',
        value: 'Любые транспортные средства, перевозящие пассажиров и багаж, движущиеся по маршруту с остановками.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Двигаясь в населенном пункте, Вы можете продолжить движение:',
    link: './img/11-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Только в направлении Б.',
        correct: true,
      },
      {
        id: '5',
        value: 'В направлениях А или Б.',
        correct: false,
      },
      {
        id: '6',
        value: 'В любом направлении из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Этот знак указывает:',
    link: './img/11-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Расстояние до конца тоннеля.',
        correct: false,
      },
      {
        id: '8',
        value: 'Расстояние до места аварийной остановки.',
        correct: false,
      },
      {
        id: '9',
        value: 'Направление движения к аварийному выходу и расстояние до него.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №4: До какого места действует требование данного знака?',
    link: './img/11-4.jpg',
    answer: [
      {
        id: '10',
        value: 'До ближайшего по ходу движения перекрестка.',
        correct: false,
      },
      {
        id: '11',
        value: 'До места установки знака «Конец зоны с ограничением максимальной скорости».',
        correct: true,
      },
      {
        id: '12',
        value: 'До конца населенного пункта.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Эта разметка, нанесенная на полосе движения:',
    link: './img/11-5.jpg',
    answer: [
      {
        id: '13',
        value: 'Предоставляет Вам преимущество при перестроении на правую полосу.',
        correct: false,
      },
      {
        id: '14',
        value: 'Предоставляет Вам преимущество при перестроении на правую полосу.',
        correct: false,
      },
      {
        id: '15',
        value: 'Информирует Вас о том, что дорога поворачивает направо.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Запрещается выполнять обгон транспортного средства, имеющего нанесенные на наружные поверхности специальные цветографические схемы:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '16',
        value: 'Только при включении на нем специального звукового сигнала.',
        correct: false,
      },
      {
        id: '17',
        value: 'Только при включении на нем проблесковых маячков синего (синего и красного) цвета.',
        correct: false,
      },
      {
        id: '18',
        value: 'При наличии обоих перечисленных условий.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №7: Обязаны ли Вы в данной ситуации подать сигнал правого поворота?',
    link: './img/11-7.jpg',
    answer: [
      {
        id: '19',
        value: 'Обязаны.',
        correct: true,
      },
      {
        id: '20',
        value: 'Обязаны только в темное время суток.',
        correct: false,
      },
      {
        id: '21',
        value: 'Не обязаны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: По какой траектории Вам разрешено выполнить поворот направо?',
    link: './img/11-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Только по А.',
        correct: true,
      },
      {
        id: '23',
        value: 'Только по Б.',
        correct: false,
      },
      {
        id: '24',
        value: 'По любой из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Вам можно выполнить разворот:',
    link: './img/11-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Только по траектории А.',
        correct: false,
      },
      {
        id: '26',
        value: 'По траекториям А или В.',
        correct: true,
      },
      {
        id: '27',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: В каких случаях разрешается выезжать за пределы правой полосы, если Вы управляете транспортным средством, скорость которого по техническим причинам не может быть более 40 км/ч?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '28',
        value: 'Только при перестроении перед поворотом налево либо разворотом.',
        correct: false,
      },
      {
        id: '29',
        value: 'Только при обгоне или объезде.',
        correct: false,
      },
      {
        id: '30',
        value: 'Во всех перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №11: Водитель обгоняемого транспортного средства:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '31',
        value: 'Должен снизить скорость.',
        correct: false,
      },
      {
        id: '32',
        value: 'Должен сместиться как можно правее.',
        correct: false,
      },
      {
        id: '33',
        value: 'Не должен препятствовать обгону путем повышения скорости движения или иными действиями.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №12: Кто из водителей нарушил правила стоянки?',
    link: './img/11-12.jpg',
    answer: [
      {
        id: '34',
        value: 'Оба.',
        correct: true,
      },
      {
        id: '35',
        value: 'Только водитель автомобиля А.',
        correct: false,
      },
      {
        id: '36',
        value: 'Только водитель автомобиля Б.',
        correct: false,
      },
      {
        id: '37',
        value: 'Никто не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Обязаны ли Вы при повороте направо уступить дорогу автомобилю, выполняющему разворот?',
    link: './img/11-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Обязаны.',
        correct: true,
      },
      {
        id: '39',
        value: 'Не обязаны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: В каком случае Вы имеете право проехать перекресток первым?',
    link: './img/11-14.jpg',
    answer: [
      {
        id: '40',
        value: 'Только при движении прямо.',
        correct: false,
      },
      {
        id: '41',
        value: 'При движении прямо и налево.',
        correct: true,
      },
      {
        id: '42',
        value: 'При движении прямо, налево и в обратном направлении.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Вы намерены продолжить движение прямо. При желтом мигающем сигнале светофора следует:',
    link: './img/11-15.jpg',
    answer: [
      {
        id: '43',
        value: 'Проехать перекресток первым.',
        correct: true,
      },
      {
        id: '44',
        value: 'Уступить дорогу только грузовому автомобилю.',
        correct: false,
      },
      {
        id: '45',
        value: 'Уступить дорогу только трамваю.',
        correct: false,
      },
      {
        id: '46',
        value: 'Уступить дорогу обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: С какой максимальной скоростью разрешается движение транспортным средствам в жилых зонах и на дворовых территориях?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '47',
        value: '10 км/ч.',
        correct: false,
      },
      {
        id: '48',
        value: '20 км/ч.',
        correct: true,
      },
      {
        id: '49',
        value: '40 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: При движении в темное время суток вне населенных пунктов необходимо использовать:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '50',
        value: 'Только фары ближнего света.',
        correct: false,
      },
      {
        id: '51',
        value: 'Только фары дальнего света.',
        correct: false,
      },
      {
        id: '52',
        value: 'Фары ближнего или дальнего света.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: В каких случаях водители привлекаются к уголовной ответственности за нарушения Правил, повлекшие тяжкие последствия?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '53',
        value: 'Только при причинении смерти человеку.',
        correct: false,
      },
      {
        id: '54',
        value: 'При причинении смерти человеку или тяжкого вреда здоровью человека.',
        correct: true,
      },
      {
        id: '55',
        value: 'При наличии пострадавшего (вне зависимости от степени тяжести полученных им повреждений) или причинении крупного материального ущерба.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: В случае остановки на подъеме (спуске) при наличии тротуара можно предотвратить самопроизвольное скатывание автомобиля, повернув его передние колеса в положение:',
    link: './img/11-19.jpg',
    answer: [
      {
        id: '56',
        value: 'А и Г.',
        correct: false,
      },
      {
        id: '57',
        value: 'Б и В.',
        correct: false,
      },
      {
        id: '58',
        value: 'А и В.',
        correct: true,
      },
      {
        id: '59',
        value: 'Б и Г.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Какое расстояние проедет транспортное средство за время, равное среднему времени реакции водителя, при скорости движения около 90 км/час?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '60',
        value: 'Примерно 15 м.',
        correct: false,
      },
      {
        id: '61',
        value: 'Примерно 25 м.',
        correct: true,
      },
      {
        id: '62',
        value: 'Примерно 35 м.',
        correct: false,
      },
    ]
  },

]

export default DATA;