export const DATA = [
  {
    question: 'Вопрос №1: Являются ли тротуары и обочины частью дороги?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Являются.',
        correct: true,
      },
      {
        id: '2',
        value: 'Являются только обочины.',
        correct: false,
      },
      {
        id: '3',
        value: 'Не являются.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: На каком расстоянии до неровного участка дороги устанавливается этот знак вне населенного пункта?',
    link: './img/17-2.jpg',
    answer: [
      {
        id: '4',
        value: '150 - 300 м.',
        correct: true,
      },
      {
        id: '5',
        value: '50 - 100 м.',
        correct: false,
      },
      {
        id: '6',
        value: 'Непосредственно перед неровным участком дороги.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Требования каких знаков из указанных вступают в силу непосредственно в том месте, где они установлены?',
    link: './img/17-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только Б.',
        correct: false,
      },
      {
        id: '8',
        value: 'А и Б.',
        correct: true,
      },
      {
        id: '9',
        value: 'Всех.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Вам разрешено продолжить движение:',
    link: './img/17-4.jpg',
    answer: [
      {
        id: '10',
        value: 'По траекториям Б или В.',
        correct: false,
      },
      {
        id: '11',
        value: 'По траекториям А или В.',
        correct: true,
      },
      {
        id: '12',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Можно ли Вам выполнить обгон при наличии данной разметки?',
    link: './img/17-5.jpg',
    answer: [
      {
        id: '13',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '14',
        value: 'Можно, если скорость трактора менее 30 км/ч.',
        correct: false,
      },
      {
        id: '15',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: В каком месте Вам следует остановиться?',
    link: './img/17-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Перед светофором.',
        correct: true,
      },
      {
        id: '17',
        value: 'Перед пересекаемой проезжей частью.',
        correct: false,
      },
      {
        id: '18',
        value: 'В любом из перечисленных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: На каком расстоянии от транспортного средства должен быть выставлен знак аварийной остановки в данной ситуации?',
    link: './img/17-7.jpg',
    answer: [
      {
        id: '19',
        value: 'Не менее 10 м.',
        correct: false,
      },
      {
        id: '20',
        value: 'Не менее 15 м.',
        correct: true,
      },
      {
        id: '21',
        value: 'Не менее 20 м.',
        correct: false,
      },
      {
        id: '22',
        value: 'Не менее 30 м.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Разрешено ли Вам выполнить поворот направо в данной ситуации?',
    link: './img/17-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '24',
        value: 'Разрешено, если при этом не будут созданы помехи транспортным средствам, движущимся с других направлений.',
        correct: false,
      },
      {
        id: '25',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Можно ли Вам выполнить разворот по данной траектории?',
    link: './img/17-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '27',
        value: 'Можно, если ширина проезжей части недостаточна для выполнения маневра из крайнего левого положения.',
        correct: true,
      },
      {
        id: '28',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: Разрешается ли водителю движение со слишком малой скоростью?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '29',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '30',
        value: 'Разрешается, если при этом не создаются помехи другим транспортным средствам.',
        correct: true,
      },
      {
        id: '31',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Можно ли Вам начать обгон в населенном пункте?',
    link: './img/17-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '33',
        value: 'Можно, если обгон будет завершен до переезда.',
        correct: false,
      },
      {
        id: '34',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №12: В каком месте на данном участке дороги Вам разрешено поставить автомобиль на длительную стоянку?',
    link: './img/17-12.jpg',
    answer: [
      {
        id: '35',
        value: 'В любом месте на обочине.',
        correct: false,
      },
      {
        id: '36',
        value: 'Только через 500 м на специальной площадке.',
        correct: true,
      },
      {
        id: '37',
        value: 'Во всех перечисленных местах.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Обязаны ли Вы уступить дорогу автобусу?',
    link: './img/17-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Обязаны.',
        correct: true,
      },
      {
        id: '39',
        value: 'Не обязаны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены повернуть налево. Ваши действия?',
    link: './img/17-14.jpg',
    answer: [
      {
        id: '40',
        value: 'Уступите дорогу обоим грузовым автомобилям.',
        correct: true,
      },
      {
        id: '41',
        value: 'Выехав на перекресток, уступите дорогу встречному грузовому автомобилю и завершите поворот.',
        correct: false,
      },
      {
        id: '42',
        value: 'Проедете перекресток  первым.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: После въезда на этот перекресток:',
    link: './img/17-15.jpg',
    answer: [
      {
        id: '43',
        value: 'Вы должны уступить дорогу легковому автомобилю, въезжающему на него.',
        correct: false,
      },
      {
        id: '44',
        value: 'Вы будете иметь преимущество перед легковым автомобилем, въезжающим на него.',
        correct: true,
      },
      {
        id: '45',
        value: 'Вам следует действовать по взаимной договоренности с водителем легкового автомобиля.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Кто из водителей должен уступить дорогу трамваю?',
    link: './img/17-16.jpg',
    answer: [
      {
        id: '46',
        value: 'Оба.',
        correct: false,
      },
      {
        id: '47',
        value: 'Только водитель грузового автомобиля.',
        correct: false,
      },
      {
        id: '48',
        value: 'Только водитель легкового автомобиля.',
        correct: false,
      },
      {
        id: '49',
        value: 'Никто из водителей.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: Можно ли буксировать автомобиль с недействующей тормозной системой, если фактическая масса этого автомобиля превышает половину фактической массы Вашего автомобиля?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '50',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '51',
        value: 'Можно только при скорости буксировки не более 30 км/ч.',
        correct: false,
      },
      {
        id: '52',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: При совершении административного правонарушения, влекущего задержание транспортного средства, оно задерживается до:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '53',
        value: 'Составления протокола об административном правонарушении.',
        correct: false,
      },
      {
        id: '54',
        value: 'Устранения причины задержания.',
        correct: true,
      },
      {
        id: '55',
        value: 'Рассмотрения дела об административном правонарушении.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Как изменяется длина тормозного пути легкового автомобиля при движении с прицепом, не имеющим тормозной системы?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '56',
        value: 'Уменьшается, так как прицеп оказывает дополнительное сопротивление движению.',
        correct: false,
      },
      {
        id: '57',
        value: 'Не изменяется.',
        correct: false,
      },
      {
        id: '58',
        value: 'Увеличивается.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №20: В темное время суток и в пасмурную погоду скорость встречного автомобиля воспринимается:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '59',
        value: 'Ниже, чем в действительности.',
        correct: true,
      },
      {
        id: '60',
        value: 'Восприятие скорости не меняется.',
        correct: false,
      },
      {
        id: '61',
        value: 'Выше, чем в действительности.',
        correct: false,
      },
    ]
  },
]

export default DATA;