export const DATA = [
  {
    question: 'Вопрос №1: Сколько проезжих частей имеет данная дорога?',
    link: './img/5-1.jpg',
    answer: [
      {
        id: '1',
        value: 'Одну.',
        correct: true,
      },
      {
        id: '2',
        value: 'Две.',
        correct: false,
      },
      {
        id: '3',
        value: 'Четыре.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: При наличии какого знака водитель должен уступить дорогу, если встречный разъезд затруднен?',
    link: './img/5-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Только В.',
        correct: false,
      },
      {
        id: '5',
        value: 'А и В.',
        correct: true,
      },
      {
        id: '6',
        value: 'Б и В.',
        correct: false,
      },
      {
        id: '7',
        value: 'Б и Г.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Разрешена ли Вам стоянка в указанном месте?',
    link: './img/5-3.jpg',
    answer: [
      {
        id: '8',
        value: 'Разрешена.',
        correct: true,
      },
      {
        id: '9',
        value: 'Разрешена только в светлое время суток.',
        correct: false,
      },
      {
        id: '10',
        value: 'Запрещена.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Нарушил ли водитель грузового автомобиля правила стоянки?',
    link: './img/5-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Нарушил.',
        correct: true,
      },
      {
        id: '12',
        value: 'Не нарушил, если разрешенная максимальная масса автомобиля не более 3,5 т.',
        correct: false,
      },
      {
        id: '13',
        value: 'Не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: О чем предупреждает Вас вертикальная разметка, нанесенная на ограждение дороги?',
    link: './img/5-1.jpg',
    answer: [
      {
        id: '14',
        value: 'О приближении к железнодорожному переезду.',
        correct: false,
      },
      {
        id: '15',
        value: 'О приближении к опасному перекрестку.',
        correct: false,
      },
      {
        id: '16',
        value: 'О движении по опасному участку дороги.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Разрешается ли водителю продолжить движение после переключения зеленого сигнала светофора на желтый, если возможно остановиться перед перекрестком, только применив экстренное торможение?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '17',
        value: 'Разрешается.',
        correct: true,
      },
      {
        id: '18',
        value: 'Разрешается, если водитель намерен проехать перекресток только в прямом направлении.',
        correct: false,
      },
      {
        id: '19',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Поднятая вверх рука водителя мотоцикла является сигналом, информирующим Вас о его намерении:',
    link: './img/5-7.jpg',
    answer: [
      {
        id: '20',
        value: 'Продолжить движение прямо.',
        correct: false,
      },
      {
        id: '21',
        value: 'Продолжить движение прямо.',
        correct: false,
      },
      {
        id: '22',
        value: 'Снизить скорость, чтобы остановиться и уступить дорогу легковому автомобилю.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №8: В каких направлениях Вам можно продолжить движение по левой полосе на грузовом автомобиле с разрешенной максимальной массой не более 3,5 т?',
    link: './img/5-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Только прямо.',
        correct: false,
      },
      {
        id: '24',
        value: 'Прямо и направо.',
        correct: false,
      },
      {
        id: '25',
        value: 'Прямо, налево и в обратном направлении.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Вам необходимо повернуть на примыкающую справа дорогу. Ваши действия?',
    link: './img/5-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Не меняя полосы, снизить скорость, затем перестроиться на полосу торможения.',
        correct: false,
      },
      {
        id: '27',
        value: 'Не меняя скорости, перестроиться на полосу торможения, затем снизить скорость.',
        correct: true,
      },
      {
        id: '28',
        value: 'Возможны оба варианта действий.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой максимальной скоростью Вы имеете право продолжить движение вне населенных пунктов на легковом автомобиле с прицепом?',
    link: './img/5-10.jpg',
    answer: [
      {
        id: '29',
        value: '50 км/ч.',
        correct: false,
      },
      {
        id: '30',
        value: '60 км/ч.',
        correct: false,
      },
      {
        id: '31',
        value: '70 км/ч.',
        correct: true,
      },
      {
        id: '32',
        value: '80 км/ч.',
        correct: false,
      },
      {
        id: '33',
        value: '90 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешен ли Вам обгон?',
    link: './img/5-11.jpg',
    answer: [
      {
        id: '34',
        value: 'Разрешен.',
        correct: true,
      },
      {
        id: '35',
        value: 'Разрешен, если обгон будет завершен до перекрестка.',
        correct: false,
      },
      {
        id: '36',
        value: 'Запрещен.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Кто из водителей нарушил правила стоянки?',
    link: './img/5-12.jpg',
    answer: [
      {
        id: '37',
        value: 'Оба.',
        correct: false,
      },
      {
        id: '38',
        value: 'Только водитель автомобиля А.',
        correct: true,
      },
      {
        id: '39',
        value: 'Только водитель автомобиля Б.',
        correct: false,
      },
      {
        id: '40',
        value: 'Никто не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены развернуться. Ваши действия?',
    link: './img/5-13.jpg',
    answer: [
      {
        id: '41',
        value: 'Проедете перекресток первым.',
        correct: false,
      },
      {
        id: '42',
        value: 'Выполните разворот, уступив дорогу легковому автомобилю.',
        correct: true,
      },
      {
        id: '43',
        value: 'Дождетесь, когда регулировщик опустит правую руку.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Кому Вы должны уступить дорогу при движении в прямом направлении?',
    link: './img/5-14.jpg',
    answer: [
      {
        id: '44',
        value: 'Только трамваю.',
        correct: true,
      },
      {
        id: '45',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '46',
        value: 'Обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Как Вам следует поступить при повороте налево?',
    link: './img/5-15.jpg',
    answer: [
      {
        id: '47',
        value: 'Проехать перекресток первым.',
        correct: true,
      },
      {
        id: '48',
        value: 'Уступить дорогу только грузовому автомобилю с включенным проблесковым маячком.',
        correct: false,
      },
      {
        id: '49',
        value: 'Уступить дорогу обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешено ли Вам проехать железнодорожный переезд?',
    link: './img/5-16.jpg',
    answer: [
      {
        id: '50',
        value: 'Разрешено, поскольку дежурный по переезду запрещает движение только встречному автомобилю.',
        correct: false,
      },
      {
        id: '51',
        value: 'Разрешено, если отсутствует приближающийся поезд.',
        correct: false,
      },
      {
        id: '52',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: В каких случаях разрешено применять звуковые сигналы в населенных пунктах?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '53',
        value: 'Только для предупреждения о намерении произвести обгон.',
        correct: false,
      },
      {
        id: '54',
        value: 'Только для предотвращения дорожно-транспортного происшествия.',
        correct: true,
      },
      {
        id: '55',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: При каком максимальном значении суммарного люфта в рулевом управлении допускается эксплуатация легкового автомобиля?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '56',
        value: '10 градусов.',
        correct: true,
      },
      {
        id: '57',
        value: '20 градусов.',
        correct: false,
      },
      {
        id: '58',
        value: '25 градусов.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Как следует поступить водителю при высадке из автомобиля, стоящего у тротуара или на обочине?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '59',
        value: '',
        correct: false,
      },
      {
        id: '60',
        value: '',
        correct: true,
      },
      {
        id: '61',
        value: '',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: При движении в условиях тумана расстояние до предметов представляется:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '62',
        value: 'Большим, чем в действительности.',
        correct: true,
      },
      {
        id: '63',
        value: 'Соответствующим действительности.',
        correct: false,
      },
      {
        id: '64',
        value: 'Меньшим, чем в действительности.',
        correct: false,
      },
    ]
  },
]

export default DATA;