export const DATA = [
  {
    question: 'Вопрос №1: Может ли владелец мотоцикла с рабочим объёмом двигателя внутреннего сгорания, не превышающим 125 см<sup>3</sup> , и максимальной мощностью, не превышающей 11 квт, передавать управление этим транспортным средством в своём присутствии другому лицу, имея страховой полис обязательного страхования гражданской ответственности на бумажном носителе или в виде электронного документа либо его копии на бумажном носителе?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Может при наличии у этого лица водительского удостоверения на право управления транспортным средством категории «А» или подкатегории «А1».',
        correct: true,
      },
      {
        id: '2',
        value: 'Может при наличии у этого лица водительского удостоверения на право управления транспортным средством подкатегории «B1».',
        correct: false,
      },
      {
        id: '3',
        value: 'Может при наличии у этого лица водительского удостоверения на право управления транспортным средством категории «M».',
        correct: false,
      },
      {
        id: '4',
        value: 'Может во всех перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: О чем информируют Вас эти дорожные знаки?',
    link: './img/7-2.jpg',
    answer: [
      {
        id: '5',
        value: 'О приближении к перекрестку, где установлен знак «Уступите дорогу».',
        correct: false,
      },
      {
        id: '6',
        value: 'О приближении к перекрестку, где установлен знак «Движение без остановки запрещено».',
        correct: true,
      },
      {
        id: '7',
        value: 'О приближении к таможне.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Разрешено ли Вам остановиться в указанном месте?',
    link: './img/7-3.jpg',
    answer: [
      {
        id: '8',
        value: 'Запрещено.',
        correct: true,
      },
      {
        id: '9',
        value: 'Разрешено только для посадки и высадки пассажиров.',
        correct: false,
      },
      {
        id: '10',
        value: 'Разрешено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Действие каких знаков из указанных распространяется только до ближайшего по ходу движения перекрестка?',
    link: './img/7-4.jpg',
    answer: [
      {
        id: '11',
        value: 'А и В.',
        correct: false,
      },
      {
        id: '12',
        value: 'Б и Г.',
        correct: true,
      },
      {
        id: '13',
        value: 'В и Г.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Что обозначают прерывистые линии разметки на перекрестке?',
    link: './img/7-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Обязательное направление движения на перекрестке.',
        correct: false,
      },
      {
        id: '15',
        value: 'Полосы движения в пределах перекрестка.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Вам разрешается движение:',
    link: './img/7-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Только прямо.',
        correct: false,
      },
      {
        id: '17',
        value: 'Прямо и направо.',
        correct: true,
      },
      {
        id: '18',
        value: 'В любом направлении.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Когда следует выключить указатели левого поворота, выполняя обгон?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '19',
        value: 'Сразу же после перестроения на полосу, предназначенную для встречного движения.',
        correct: true,
      },
      {
        id: '20',
        value: 'После опережения обгоняемого транспортного средства.',
        correct: false,
      },
      {
        id: '21',
        value: 'По усмотрению водителя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Обязан ли водитель легкового автомобиля уступить дорогу водителю грузового автомобиля?',
    link: './img/7-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Обязан.',
        correct: false,
      },
      {
        id: '23',
        value: 'Обязан, если водитель грузового автомобиля начнет смещаться вправо.',
        correct: false,
      },
      {
        id: '24',
        value: 'Не обязан.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Разрешен ли Вам разворот на этом участке дороги?',
    link: './img/7-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Разрешен.',
        correct: false,
      },
      {
        id: '26',
        value: 'Разрешен только при видимости дороги не менее 100 м.',
        correct: true,
      },
      {
        id: '27',
        value: 'Запрещен.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой скоростью мотоциклам разрешается движение вне населенных пунктов на автомагистралях?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '28',
        value: 'Не более 90 км/ч.',
        correct: false,
      },
      {
        id: '29',
        value: 'Не более 110 км/ч.',
        correct: true,
      },
      {
        id: '30',
        value: 'Не более 130 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешается ли Вам в конце подъема перестроиться на среднюю полосу для опережения грузового автомобиля?',
    link: './img/7-11.jpg',
    answer: [
      {
        id: '31',
        value: 'Разрешается.',
        correct: true,
      },
      {
        id: '32',
        value: 'Разрешается только при видимости дороги не менее 100 м.',
        correct: false,
      },
      {
        id: '33',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: В каком из указанных мест Вам можно поставить на стоянку легковой автомобиль?',
    link: './img/7-12.jpg',
    answer: [
      {
        id: '34',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '35',
        value: 'Только В.',
        correct: false,
      },
      {
        id: '36',
        value: 'А или В.',
        correct: true,
      },
      {
        id: '37',
        value: 'В любом.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Как Вам следует поступить при повороте налево?',
    link: './img/7-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Проехать перекресток первым.',
        correct: false,
      },
      {
        id: '39',
        value: 'Выехать за стоп-линию и остановиться на перекрестке, чтобы уступить дорогу встречному автомобилю.',
        correct: true,
      },
      {
        id: '40',
        value: 'Остановиться перед стоп-линией и после проезда легкового автомобиля повернуть налево.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Разрешено ли Вам выехать на перекресток, за которым образовался затор?',
    link: './img/7-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '42',
        value: 'Разрешено, если Вы намерены выполнить поворот.',
        correct: true,
      },
      {
        id: '43',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Вы намерены продолжить движение прямо. Кому Вы обязаны уступить дорогу?',
    link: './img/7-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Только мотоциклу.',
        correct: false,
      },
      {
        id: '45',
        value: 'Мотоциклу и легковому автомобилю.',
        correct: false,
      },
      {
        id: '46',
        value: 'Никому.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №16: Где могут двигаться пешеходы в жилой зоне?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '47',
        value: 'Только по тротуарам.',
        correct: false,
      },
      {
        id: '48',
        value: 'По тротуарам и в один ряд по краю проезжей части.',
        correct: false,
      },
      {
        id: '49',
        value: 'По тротуарам и по всей ширине проезжей части.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: На каком рисунке изображен автомобиль, водитель которого не нарушает правил перевозки грузов?',
    link: './img/7-17.jpg',
    answer: [
      {
        id: '50',
        value: 'Только на А.',
        correct: false,
      },
      {
        id: '51',
        value: 'Только на Б.',
        correct: false,
      },
      {
        id: '52',
        value: 'На обоих.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: В каких случаях разрешается эксплуатация транспортного средства?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '53',
        value: 'Содержание вредных веществ в отработавших газах или их дымность превышают установленные нормы.',
        correct: false,
      },
      {
        id: '54',
        value: 'Нарушена герметичность системы питания (топливной системы).',
        correct: false,
      },
      {
        id: '55',
        value: 'Не работает указатель температуры охлаждающей жидкости.',
        correct: true,
      },
      {
        id: '56',
        value: 'Уровень внешнего шума превышает установленные нормы.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Двигаться по глубокому снегу на грунтовой дороге следует:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '57',
        value: 'Изменяя скорость движения и передачу в зависимости от состояния дороги.',
        correct: false,
      },
      {
        id: '58',
        value: 'На заранее выбранной пониженной передаче, без резких поворотов и остановок.',
        correct: true,
      },
      {
        id: '59',
        value: 'На заранее выбранной повышенной передаче, без резких поворотов и остановок.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Какую оптимальную позу следует придать пострадавшему, находящемуся в сознании, при подозрении на травму позвоночника?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '60',
        value: 'Уложить пострадавшего на бок.',
        correct: false,
      },
      {
        id: '61',
        value: 'Уложить пострадавшего на спину на твердой ровной поверхности, без необходимости его не перемещать, позу не менять.',
        correct: true,
      },
      {
        id: '62',
        value: 'Уложить пострадавшего на спину, подложить под шею валик из одежды и приподнять ноги.',
        correct: false,
      },
    ]
  },
]

export default DATA;