export const DATA = [
  {
    question: 'Вопрос №1: Главная дорога показана:',
    link: './img/10-1.jpg',
    answer: [
      {
        id: '1',
        value: 'Только на левом верхнем рисунке.',
        correct: false,
      },
      {
        id: '2',
        value: 'На левом верхнем и нижнем рисунках.',
        correct: true,
      },
      {
        id: '3',
        value: 'На всех рисунках.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Какие из указанных знаков распространяют свое действие только на период времени, когда покрытие проезжей части влажное?',
    link: './img/10-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Только А.',
        correct: true,
      },
      {
        id: '5',
        value: 'А и Б.',
        correct: false,
      },
      {
        id: '6',
        value: 'Все.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Разрешается ли Вам поставить автомобиль на стоянку в указанном месте?',
    link: './img/10-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '8',
        value: 'Разрешается, если Вы проживаете рядом с этим местом.',
        correct: false,
      },
      {
        id: '9',
        value: 'Запрещается.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №4: Вы управляете грузовым автомобилем с разрешенной максимальной массой не более 3,5 т. В каком направлении Вам разрешено дальнейшее движение?',
    link: './img/10-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только направо.',
        correct: false,
      },
      {
        id: '11',
        value: 'Направо, налево и в обратном направлении.',
        correct: false,
      },
      {
        id: '12',
        value: 'В любом.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Такой вертикальной разметкой обозначают:',
    link: './img/10-5.jpg',
    answer: [
      {
        id: '13',
        value: 'Все вертикальные элементы дорожных сооружений.',
        correct: false,
      },
      {
        id: '14',
        value: 'Только вертикальные элементы дорожных сооружений, представляющие опасность для движущихся транспортных средств.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Каким транспортным средствам разрешено продолжить движение?',
    link: './img/10-6.jpg',
    answer: [
      {
        id: '15',
        value: 'Легковому автомобилю и маломестному автобусу.',
        correct: true,
      },
      {
        id: '16',
        value: 'Только автобусу.',
        correct: false,
      },
      {
        id: '17',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '18',
        value: 'Обоим транспортным средствам движение запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Вы намерены произвести разворот на перекрестке. Какие указатели поворота необходимо включить перед въездом на перекресток?',
    link: './img/10-7.jpg',
    answer: [
      {
        id: '19',
        value: 'Правого поворота.',
        correct: true,
      },
      {
        id: '20',
        value: 'Левого поворота.',
        correct: false,
      },
      {
        id: '21',
        value: 'Включать указатели поворота нет необходимости.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: По какой траектории Вам разрешается выполнить поворот налево?',
    link: './img/10-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Только по А.',
        correct: false,
      },
      {
        id: '23',
        value: 'Только по Б.',
        correct: true,
      },
      {
        id: '24',
        value: 'По любой из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Водитель легкового автомобиля в данной ситуации:',
    link: './img/10-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Должен уступить дорогу, поскольку он двигается по полосе разгона.',
        correct: true,
      },
      {
        id: '26',
        value: 'Имеет преимущество, поскольку он двигается по полосе разгона.',
        correct: false,
      },
      {
        id: '27',
        value: 'Имеет преимущество, поскольку он находится справа от грузового автомобиля.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: Что должно иметь решающее значение при выборе водителем скорости движения в темное время суток?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '28',
        value: 'Предельные ограничения скорости, установленные Правилами.',
        correct: false,
      },
      {
        id: '29',
        value: 'Максимальная конструктивная скорость, установленная технической характеристикой используемого транспортного средства.',
        correct: false,
      },
      {
        id: '30',
        value: 'Условия видимости.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №11: Можно ли Вам обогнать трактор?',
    link: './img/10-11.jpg',
    answer: [
      {
        id: '31',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '32',
        value: 'Можно, если обгон будет завершен не ближе чем за 100 м до переезда.',
        correct: true,
      },
      {
        id: '33',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Где разрешается стоянка в целях длительного отдыха или ночлега на дорогах вне населенного пункта?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '34',
        value: 'Только на хорошо просматриваемом месте на обочине.',
        correct: false,
      },
      {
        id: '35',
        value: 'Только на предусмотренных для этого площадках или за пределами дороги.',
        correct: true,
      },
      {
        id: '36',
        value: 'В любом из перечисленных мест.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: При включении зеленого сигнала светофора Вам следует:',
    link: './img/10-13.jpg',
    answer: [
      {
        id: '37',
        value: 'Сразу начать движение.',
        correct: false,
      },
      {
        id: '38',
        value: 'Начать движение, убедившись в отсутствии только пешеходов, завершающих переход проезжей части.',
        correct: false,
      },
      {
        id: '39',
        value: 'Начать движение, убедившись в отсутствии пешеходов и транспортных средств, завершающих движение после смены сигнала светофора.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены проехать перекресток в прямом направлении. Кому Вы обязаны уступить дорогу?',
    link: './img/10-14.jpg',
    answer: [
      {
        id: '40',
        value: 'Только трамваю.',
        correct: false,
      },
      {
        id: '41',
        value: 'Только грузовому автомобилю.',
        correct: false,
      },
      {
        id: '42',
        value: 'Обоим транспортным средствам.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы должны уступить дорогу при повороте налево?',
    link: './img/10-15.jpg',
    answer: [
      {
        id: '43',
        value: 'Только автобусу.',
        correct: false,
      },
      {
        id: '44',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '45',
        value: 'Никому.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешен ли Вам въезд на железнодорожный переезд в данной ситуации?',
    link: './img/10-16.jpg',
    answer: [
      {
        id: '46',
        value: 'Разрешен.',
        correct: false,
      },
      {
        id: '47',
        value: 'Разрешен, если отсутствует приближающийся поезд.',
        correct: false,
      },
      {
        id: '48',
        value: 'Запрещен.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: При движении в условиях недостаточной видимости можно использовать противотуманные фары:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '49',
        value: 'Только отдельно от ближнего или дальнего света фар.',
        correct: false,
      },
      {
        id: '50',
        value: 'Только совместно с ближним или дальним светом фар.',
        correct: true,
      },
      {
        id: '51',
        value: 'Как отдельно, так и совместно с ближним или дальним светом фар.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: Какие из перечисленных транспортных средств разрешается эксплуатировать без медицинской аптечки?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '52',
        value: 'Автомобили.',
        correct: false,
      },
      {
        id: '53',
        value: 'Автобусы.',
        correct: false,
      },
      {
        id: '54',
        value: 'Все мотоциклы.',
        correct: false,
      },
      {
        id: '55',
        value: 'Только мотоциклы без бокового прицепа.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: При приближении к вершине подъема в темное время суток водителю следует:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '56',
        value: 'Не переключать дальний свет фар на ближний.',
        correct: false,
      },
      {
        id: '57',
        value: 'Переключать дальний свет фар на ближний только при появлении встречного транспортного средства.',
        correct: false,
      },
      {
        id: '58',
        value: 'Всегда переключать дальний свет фар на ближний.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №20: Какова первая помощь при черепно-мозговой травме, сопровождающейся ранением волосистой части головы?',
    link: './img/10-1.jpg',
    answer: [
      {
        id: '59',
        value: 'Остановить кровотечение прямым давлением на рану и наложить давящую повязку. При потере сознания придать устойчивое боковое положение. По возможности, приложить к голове холод.',
        correct: true,
      },
      {
        id: '60',
        value: 'Фиксировать шейный отдел позвоночника с помощью импровизированной шейной шины (воротника). На рану наложить стерильный ватный тампон, пострадавшего уложить на спину, приподняв ноги. По возможности, к голове приложить холод.',
        correct: false,
      },
      {
        id: '61',
        value: 'Шейную шину не накладывать, рану заклеить медицинским пластырем, пострадавшего уложить на бок.',
        correct: false,
      },
    ]
  },
]

export default DATA;