export const DATA = [
  {
    question: 'Вопрос №1: Какое удостоверение достаточно иметь водителю, управляющему легковым автомобилем с прицепом, разрешенная максимальная масса которого не превышает 750кг?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'На право управления транспортным средством подкатегории «B1».',
        correct: false,
      },
      {
        id: '2',
        value: 'На право управления транспортным средством категории «B».',
        correct: true,
      },
      {
        id: '3',
        value: 'На право управления транспортными средствами категорий «BE».',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Знаки предупреждают Вас о том, что:',
    link: './img/9-2.jpg',
    answer: [
      {
        id: '4',
        value: 'На протяжении 150 м возможно появление пешеходов на проезжей части.',
        correct: false,
      },
      {
        id: '5',
        value: 'Через 150 м находится пешеходный переход.',
        correct: true,
      },
      {
        id: '6',
        value: 'Через 150 м находится пешеходная дорожка.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Вам разрешено продолжить движение:',
    link: './img/9-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только в направлении Б.',
        correct: true,
      },
      {
        id: '8',
        value: 'В направлениях А или Б.',
        correct: false,
      },
      {
        id: '9',
        value: 'В направлениях Б или В.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Какие из указанных знаков запрещают движение транспортных средств, скорость которых по технической характеристике или их состоянию менее 40 км/ч?',
    link: './img/9-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '11',
        value: 'Только В.',
        correct: false,
      },
      {
        id: '12',
        value: 'А и Б.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Можно ли Вам выполнить обгон при наличии данной разметки?',
    link: './img/9-5.jpg',
    answer: [
      {
        id: '13',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '14',
        value: 'Можно, если скорость трактора менее 30 км/ч.',
        correct: false,
      },
      {
        id: '15',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: В каких направлениях регулировщик разрешает Вам движение?',
    link: './img/9-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Только прямо.',
        correct: false,
      },
      {
        id: '17',
        value: 'Прямо и направо.',
        correct: true,
      },
      {
        id: '18',
        value: 'Во всех направлениях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Когда следует включать указатели поворота?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '19',
        value: 'Непосредственно перед поворотом или разворотом.',
        correct: false,
      },
      {
        id: '20',
        value: 'Заблаговременно до начала выполнения маневра.',
        correct: true,
      },
      {
        id: '21',
        value: 'По своему усмотрению.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Кто должен уступить дорогу?',
    link: './img/9-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Водитель, намеревающийся начать движение от тротуара.',
        correct: true,
      },
      {
        id: '23',
        value: 'Водитель, намеревающийся остановиться у тротуара.',
        correct: false,
      },
      {
        id: '24',
        value: 'В данной ситуации водителям следует действовать по взаимной договоренности.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Разрешено ли Вам выполнить разворот в этом месте?',
    link: './img/9-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '26',
        value: 'Разрешено, если при этом не будут созданы помехи движению маршрутных транспортных средств.',
        correct: false,
      },
      {
        id: '27',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: По какой траектории Вам разрешается продолжить движение?',
    link: './img/9-10.jpg',
    answer: [
      {
        id: '27',
        value: 'Только по А.',
        correct: false,
      },
      {
        id: '28',
        value: 'Только по Б.',
        correct: true,
      },
      {
        id: '29',
        value: 'По любой из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Можно ли Вам после опережения грузового автомобиля продолжить движение по левой полосе вне населенных пунктов?',
    link: './img/9-11.jpg',
    answer: [
      {
        id: '30',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '31',
        value: 'Можно, если Вы управляете легковым автомобилем.',
        correct: false,
      },
      {
        id: '32',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №12: Разрешено ли Вам остановиться на легковом автомобиле в указанном месте?',
    link: './img/9-12.jpg',
    answer: [
      {
        id: '33',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '34',
        value: 'Разрешено, если Вы намерены высадить пассажира.',
        correct: false,
      },
      {
        id: '35',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №13: Разрешено ли Вам выехать на перекресток, за которым образовался затор:',
    link: './img/9-13.jpg',
    answer: [
      {
        id: '36',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '37',
        value: 'Разрешено, если Вы намерены выполнить поворот.',
        correct: true,
      },
      {
        id: '38',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены продолжить движение в прямом направлении. Ваши действия?',
    link: './img/9-14.jpg',
    answer: [
      {
        id: '38',
        value: 'Проедете перекресток первым.',
        correct: false,
      },
      {
        id: '39',
        value: 'Уступите дорогу грузовому автомобилю.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы обязаны уступить дорогу при повороте налево?',
    link: './img/9-15.jpg',
    answer: [
      {
        id: '40',
        value: 'Только автобусу.',
        correct: false,
      },
      {
        id: '41',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '42',
        value: 'Никому.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешается ли движение задним ходом на автомагистрали?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '43',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '44',
        value: 'Разрешается, если транспортное средство находится правее сплошной линии разметки, обозначающей край проезжей части автомагистрали.',
        correct: false,
      },
      {
        id: '45',
        value: 'Запрещается.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: Водителям мопедов разрешено двигаться:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '46',
        value: 'Только по правому краю проезжей части в один ряд.',
        correct: false,
      },
      {
        id: '47',
        value: 'Только по обочине, если не создаются помехи пешеходам.',
        correct: false,
      },
      {
        id: '48',
        value: 'Только по полосе для велосипедистов.',
        correct: false,
      },
      {
        id: '49',
        value: 'Во всех перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: Дальнейшее движение транспортного средства (даже к месту стоянки или ремонта) при негорящих (отсутствующих) фарах и задних габаритных огнях запрещается:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '50',
        value: 'Только в условиях недостаточной видимости.',
        correct: false,
      },
      {
        id: '51',
        value: 'Только в темное время суток.',
        correct: false,
      },
      {
        id: '52',
        value: 'В обоих перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: Способ разворота с использованием прилегающей территории слева, обеспечивающий безопасность движения, показан:',
    link: './img/9-19.jpg',
    answer: [
      {
        id: '53',
        value: 'Только на левом рисунке.',
        correct: false,
      },
      {
        id: '54',
        value: 'Только на правом рисунке.',
        correct: true,
      },
      {
        id: '55',
        value: 'На обоих рисунках.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Вероятность возникновения аварийной ситуации при движении в плотном транспортном потоке будет меньше, если скорость Вашего транспортного средства:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '56',
        value: 'Значительно меньше средней скорости потока.',
        correct: false,
      },
      {
        id: '57',
        value: 'Близка к средней скорости потока.',
        correct: true,
      },
      {
        id: '58',
        value: 'Значительно больше средней скорости потока.',
        correct: false,
      },
    ]
  },
]

export default DATA;