export const DATA = [
  {
    question: 'Вопрос №1: Что означает термин «Ограниченная видимость»?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'Видимость водителем дороги, ограниченная рельефом местности, геометрическими параметрами дороги, растительностью, строениями, сооружениями или другими объектами.',
        correct: true,
      },
      {
        id: '2',
        value: 'Видимость водителем дороги менее 300 м в условиях тумана, дождя, снегопада, а также в сумерки.',
        correct: false,
      },
      {
        id: '3',
        value: 'Видимость дороги менее 150 м в ночное время.',
        correct: false,
      },
      {
        id: '4',
        value: 'Видимость водителем дороги во всех перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: О чем предупреждают Вас эти знаки?',
    link: './img/14-2.jpg',
    answer: [
      {
        id: '5',
        value: 'Остановка транспортных средств на обочине запрещена.',
        correct: false,
      },
      {
        id: '6',
        value: 'Съезд на обочину опасен в связи с проведением на ней дорожных работ.',
        correct: true,
      },
      {
        id: '7',
        value: 'В месте производства дорожных работ стоянка запрещена.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Какие из указанных знаков разрешают движение грузовым автомобилям с разрешенной максимальной массой не более 3,5 т?',
    link: './img/14-3.jpg',
    answer: [
      {
        id: '8',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '9',
        value: 'А и В.',
        correct: true,
      },
      {
        id: '10',
        value: 'Все.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Вам можно продолжить движение по крайней левой полосе на легковом автомобиле:',
    link: './img/14-4.jpg',
    answer: [
      {
        id: '11',
        value: 'Только налево.',
        correct: false,
      },
      {
        id: '12',
        value: 'Прямо или налево.',
        correct: false,
      },
      {
        id: '13',
        value: 'Прямо, налево или в обратном направлении.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: В каком из указанных мест Вам разрешено пересечь сплошную линию разметки и остановиться?',
    link: './img/14-5.jpg',
    answer: [
      {
        id: '14',
        value: 'А и Б.',
        correct: false,
      },
      {
        id: '15',
        value: 'Только Б.',
        correct: true,
      },
      {
        id: '16',
        value: 'В указанных местах пересекать сплошную линию разметки запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Должны ли Вы остановиться по требованию регулировщика в указанном им месте?',
    link: './img/14-6.jpg',
    answer: [
      {
        id: '17',
        value: 'Должны.',
        correct: true,
      },
      {
        id: '18',
        value: 'Должны только с заездом на тротуар.',
        correct: false,
      },
      {
        id: '19',
        value: 'Не должны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Такой сигнал рукой, подаваемый водителем мотоцикла, информирует Вас:',
    link: './img/14-7.jpg',
    answer: [
      {
        id: '20',
        value: 'О его намерении повернуть налево или выполнить разворот.',
        correct: true,
      },
      {
        id: '21',
        value: 'О его намерении продолжить движение прямо или налево.',
        correct: false,
      },
      {
        id: '22',
        value: 'О наличии транспортного средства, приближающегося слева.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: По какой траектории Вам разрешается выполнить поворот налево?',
    link: './img/14-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Только по А.',
        correct: false,
      },
      {
        id: '24',
        value: 'Только по Б.',
        correct: false,
      },
      {
        id: '25',
        value: 'По любой из указанных.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Можно ли Вам развернуться в этом месте?',
    link: './img/14-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '27',
        value: 'Можно только в светлое время суток.',
        correct: false,
      },
      {
        id: '28',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: Допускается ли движение автомобилей по тротуарам или пешеходным дорожкам?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '29',
        value: 'Допускается.',
        correct: false,
      },
      {
        id: '30',
        value: 'Допускается только при доставке грузов к торговым и другим предприятиям, расположенным непосредственно у тротуаров или пешеходных дорожек, если отсутствуют другие возможности подъезда.',
        correct: true,
      },
      {
        id: '31',
        value: 'Не допускается.',
        correct: false,
      },
    ]
  },
   {
     question: 'Вопрос №11: В данной ситуации Вы:',
    link: './img/14-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Должны уступить дорогу, так как встречный автомобиль движется на подъем.',
        correct: true,
      },
      {
        id: '33',
        value: 'Имеете право проехать первым, так как Вы движетесь на спуск.',
        correct: false,
      },
      {
        id: '34',
        value: 'Имеете право проехать первым, так как препятствие находится на полосе движения встречного автомобиля.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Разрешено ли Вам остановиться на мосту в этом месте?',
    link: './img/14-12.jpg',
    answer: [
      {
        id: '35',
        value: 'Разрешено.',
        correct: true,
      },
      {
        id: '36',
        value: 'Разрешено только для высадки пассажиров.',
        correct: false,
      },
      {
        id: '37',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: При включении зеленого сигнала светофора Вы должны уступить дорогу:',
    link: './img/14-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Только грузовому автомобилю, завершающему разворот на перекрестке.',
        correct: false,
      },
      {
        id: '39',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '40',
        value: 'Обоим автомобилям.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены проехать перекресток в прямом направлении. Кому Вы обязаны уступить дорогу?',
    link: './img/14-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Только трамваю А.',
        correct: false,
      },
      {
        id: '42',
        value: 'Только трамваю Б.',
        correct: false,
      },
      {
        id: '43',
        value: 'Обоим трамваям.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: При повороте налево Вы:',
    link: './img/14-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Имеете преимущество.',
        correct: false,
      },
      {
        id: '45',
        value: 'Должны уступить дорогу только автобусу.',
        correct: true,
      },
      {
        id: '46',
        value: 'Должны уступить дорогу легковому автомобилю и автобусу.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Кто из водителей нарушает правила разворота на автомагистрали?',
    link: './img/14-16.jpg',
    answer: [
      {
        id: '47',
        value: 'Оба.',
        correct: false,
      },
      {
        id: '48',
        value: 'Только водитель легкового автомобиля.',
        correct: true,
      },
      {
        id: '49',
        value: 'Только водитель грузового автомобиля, выполняющего работы по ремонту или содержанию дорог.',
        correct: false,
      },
      {
        id: '50',
        value: 'Никто не нарушает.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: Буксировка двухколесного мотоцикла разрешается:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '51',
        value: 'Только если мотоцикл с боковым прицепом, а водитель соответствующего буксирующего транспортного средства имеет право на управления транспортными средствами в течение двух и более лет.',
        correct: true,
      },
      {
        id: '52',
        value: 'Если мотоцикл с боковым прицепом.',
        correct: false,
      },
      {
        id: '53',
        value: 'Если водитель соответствующего буксирующего транспортного средства имеет право на управления транспортными средствами в течение двух и более лет.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: В каком из перечисленных случаев разрешается эксплуатация автомобиля?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '54',
        value: 'Шины имеют отслоения протектора или боковины.',
        correct: false,
      },
      {
        id: '55',
        value: 'Шины имеют порезы, обнажающие корд.',
        correct: false,
      },
      {
        id: '56',
        value: 'На задней оси автомобиля установлены шины с восстановленным рисунком протектора.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: Как влияет длительный разгон транспортного средства с включенной первой передачей на расход топлива?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '57',
        value: 'Расход топлива увеличивается.',
        correct: true,
      },
      {
        id: '58',
        value: 'Расход топлива не изменяется.',
        correct: false,
      },
      {
        id: '59',
        value: 'Расход топлива уменьшается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Является ли безопасным движение вне населенного пункта на легковом автомобиле в темное время суток с включенным ближним светом фар по неосвещенному участку дороги со скоростью 90 км/ч?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '60',
        value: 'Является безопасным, поскольку предельная допустимая скорость соответствует требованиям Правил.',
        correct: false,
      },
      {
        id: '61',
        value: 'Является безопасным при малой интенсивности движения.',
        correct: false,
      },
      {
        id: '62',
        value: 'Не является безопасным, поскольку остановочный путь превышает расстояние видимости.',
        correct: true,
      },
    ]
  },  
]

export default DATA;