export const DATA = [
  {
    question: 'Вопрос №1: Соответствуют ли действия водителя Правилам, если он движется посередине дороги?',
    link: './img/13-1.jpg',
    answer: [
      {
        id: '1',
        value: 'Соответствуют.',
        correct: false,
      },
      {
        id: '2',
        value: 'Соответствуют, если отсутствуют встречные транспортные средства.',
        correct: false,
      },
      {
        id: '3',
        value: 'Не соответствуют.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №2: Как следует поступить, если Вам необходимо развернуться?',
    link: './img/13-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Развернуться на этом перекрестке при отсутствии на нем других транспортных средств.',
        correct: false,
      },
      {
        id: '5',
        value: 'Проехать прямо и развернуться за перекрестком.',
        correct: true,
      },
      {
        id: '6',
        value: 'Проехать прямо и развернуться только на следующем перекрестке.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Разрешена ли Вам стоянка в указанном месте?',
    link: './img/13-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Разрешена.',
        correct: false,
      },
      {
        id: '8',
        value: 'Разрешена только с включенной аварийной сигнализацией.',
        correct: false,
      },
      {
        id: '9',
        value: 'Запрещена',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №4: Эта табличка распространяет действие установленного с ней знака:',
    link: './img/13-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только на легковые автомобили.',
        correct: false,
      },
      {
        id: '11',
        value: 'На легковые автомобили, а также на грузовые автомобили с разрешенной максимальной массой не более 3,5 т.',
        correct: true,
      },
      {
        id: '12',
        value: 'На легковые автомобили и мотоциклы.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Какой пешеходный переход обозначает данная разметка?',
    link: './img/13-5.jpg',
    answer: [
      {
        id: '13',
        value: 'Только регулируемый.',
        correct: false,
      },
      {
        id: '14',
        value: 'Только нерегулируемый.',
        correct: false,
      },
      {
        id: '15',
        value: 'Любой.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №6: Ваши действия в данной ситуации?',
    link: './img/13-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Проедете переезд, убедившись в отсутствии приближающегося поезда.',
        correct: true,
      },
      {
        id: '17',
        value: 'Остановитесь у светофора, а затем проедете переезд.',
        correct: false,
      },
      {
        id: '18',
        value: 'Дождетесь выключения бело-лунного мигающего сигнала и проедете переезд.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Когда может быть прекращена подача сигнала рукой о повороте?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '19',
        value: 'Непосредственно перед началом маневра.',
        correct: true,
      },
      {
        id: '20',
        value: 'После начала маневра.',
        correct: false,
      },
      {
        id: '21',
        value: 'Только после окончания маневра.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Из какой полосы разрешено въехать на данный перекресток?',
    link: './img/13-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Только из правой.',
        correct: false,
      },
      {
        id: '23',
        value: 'Только из левой.',
        correct: false,
      },
      {
        id: '24',
        value: 'Из любой.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Разрешается ли Вам выполнить разворот на этом участке дороги?',
    link: './img/13-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '26',
        value: 'Разрешается только при видимости дороги не менее 100 м.',
        correct: true,
      },
      {
        id: '27',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?',
    link: './img/13-10.jpg',
    answer: [
      {
        id: '28',
        value: '60 км/ч.',
        correct: false,
      },
      {
        id: '29',
        value: '70 км/ч.',
        correct: false,
      },
      {
        id: '30',
        value: '90 км/ч.',
        correct: true,
      },
      {
        id: '31',
        value: '110 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Сколько транспортных средств Вам можно обогнать одновременно после проезда пешеходного перехода?',
    link: './img/13-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Только одно.',
        correct: false,
      },
      {
        id: '33',
        value: 'Только два.',
        correct: false,
      },
      {
        id: '34',
        value: 'Все три.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №12: Разрешено ли Вам остановиться на мосту для посадки пассажира?',
    link: './img/13-12.jpg',
    answer: [
      {
        id: '35',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '36',
        value: 'Разрешено, только если Вы управляете такси.',
        correct: false,
      },
      {
        id: '37',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены проехать перекресток в прямом направлении. Ваши действия?',
    link: './img/13-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Проедете перекресток первым.',
        correct: true,
      },
      {
        id: '39',
        value: 'Уступите дорогу трамваю.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Кто из водителей, выполняющих поворот, должен уступить дорогу пешеходам?',
    link: './img/13-14.jpg',
    answer: [
      {
        id: '40',
        value: 'Только водитель легкового автомобиля.',
        correct: false,
      },
      {
        id: '41',
        value: 'Только водитель грузового автомобиля.',
        correct: false,
      },
      {
        id: '42',
        value: 'Оба.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: Можете ли Вы в данной ситуации приступить к повороту налево?',
    link: './img/13-15.jpg',
    answer: [
      {
        id: '43',
        value: 'Можете.',
        correct: false,
      },
      {
        id: '44',
        value: 'Можете, только убедившись в том, что не создадите помех встречному автомобилю, выполняющему поворот налево.',
        correct: true,
      },
      {
        id: '45',
        value: 'Не можете.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешается ли Вам на легковом автомобиле перестроиться вправо, чтобы продолжить движение в прямом направлении?',
    link: './img/13-16.jpg',
    answer: [
      {
        id: '46',
        value: 'Разрешается, если не создадите помех движению маршрутных транспортных средств.',
        correct: false,
      },
      {
        id: '47',
        value: 'Разрешается, если Вы управляете легковым такси.',
        correct: true,
      },
      {
        id: '48',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: Задние противотуманные фонари можно использовать:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '49',
        value: 'Только в условиях недостаточной видимости.',
        correct: true,
      },
      {
        id: '50',
        value: 'Только при движении в темное время суток.',
        correct: false,
      },
      {
        id: '51',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: При возникновении какой неисправности запрещено дальнейшее движение транспортного средства даже до места ремонта или стоянки?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '52',
        value: 'Не работает стеклоподъемник.',
        correct: false,
      },
      {
        id: '53',
        value: 'Неисправно рулевое управление.',
        correct: true,
      },
      {
        id: '54',
        value: 'Неисправен глушитель.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Двигаясь в прямом направлении, Вы внезапно попали на небольшой участок скользкой дороги. Что следует предпринять?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '55',
        value: 'Плавно затормозить.',
        correct: false,
      },
      {
        id: '56',
        value: 'Повернуть руль, чтобы съехать с этого участка дороги.',
        correct: false,
      },
      {
        id: '57',
        value: 'Не менять траектории и скорости движения.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №20: На какой срок может быть наложен кровоостанавливающий жгут?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '58',
        value: 'Не более получаса в теплое время года и не более одного часа в холодное время года.',
        correct: false,
      },
      {
        id: '59',
        value: 'Не более одного часа в теплое время года и не более получаса в холодное время года.',
        correct: true,
      },
      {
        id: '60',
        value: 'Время наложения жгута не ограничено.',
        correct: false,
      },
    ]
  },
]

export default DATA;