export const DATA = [
  {
    question: 'Вопрос №1: В каком случае водитель совершит вынужденную остановку?',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '1',
        value: 'Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.',
        correct: false,
      },
      {
        id: '2',
        value: 'Остановившись на проезжей части из-за технической неисправности транспортного средства.',
        correct: true,
      },
      {
        id: '3',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Разрешен ли Вам поворот на дорогу с грунтовым покрытием?',
    link: './img/ticket__01/01__02.jpg',
    answer: [
      {
        id: '4',
        value: 'Разрешен.',
        correct: true,
      },
      {
        id: '5',
        value: 'Разрешен только при технической неисправности транспортного средства.',
        correct: false,
      },
      {
        id: '6',
        value: 'Запрещен.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Можно ли Вам остановиться в указанном месте для посадки пассажира?',
    link: './img/ticket__01/01__03.jpg',
    answer: [
      {
        id: '7',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '8',
        value: 'Можно, если Вы управляете такси.',
        correct: false,
      },
      {
        id: '9',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Какие из указанных знаков запрещают движение водителям мопедов?',
    link: './img/ticket__01/01__04.jpg',
    answer: [
      {
        id: '10',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '11',
        value: 'Только Б.',
        correct: false,
      },
      {
        id: '12',
        value: 'В и Г.',
        correct: false,
      },
      {
        id: '13',
        value: 'Все.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №5: Вы намерены повернуть налево. Где следует остановиться, чтобы уступить дорогу легковому автомобилю?',
    link: './img/ticket__01/01__05.jpg',
    answer: [
      {
        id: '14',
        value: 'Перед знаком.',
        correct: false,
      },
      {
        id: '15',
        value: 'Перед перекрестком у линии разметки.',
        correct: false,
      },
      {
        id: '16',
        value: 'На перекрестке перед прерывистой линией разметки.',
        correct: true,
      },
      {
        id: '17',
        value: 'В любом месте по усмотрению водителя..',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Что означает мигание зеленого сигнала светофора?',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '18',
        value: 'Предупреждает о неисправности светофора.',
        correct: false,
      },
      {
        id: '19',
        value: 'Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал.',
        correct: true,
      },
      {
        id: '20',
        value: 'Запрещает дальнейшее движение.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Водитель обязан подавать сигналы световыми указателями поворота (рукой):',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '21',
        value: 'Перед началом движения или перестроением.',
        correct: false,
      },
      {
        id: '22',
        value: 'Перед поворотом или разворотом.',
        correct: false,
      },
      {
        id: '23',
        value: 'Перед остановкой.',
        correct: false,
      },
      {
        id: '24',
        value: 'Во всех перечисленных случаях.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №8: Как Вам следует поступить при повороте направо?',
    link: './img/ticket__01/01__08.jpg',
    answer: [
      {
        id: '25',
        value: 'Перестроиться на правую полосу, затем осуществить поворот.',
        correct: true,
      },
      {
        id: '26',
        value: 'Продолжить движение по второй полосе до перекрестка, затем повернуть.',
        correct: false,
      },
      {
        id: '27',
        value: 'Возможны оба варианта действий.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: По какой траектории Вам разрешено выполнить разворот?',
    link: './img/ticket__01/01__09.jpg',
    answer: [
      {
        id: '28',
        value: 'Только по А.',
        correct: true,
      },
      {
        id: '29',
        value: 'Только по Б.',
        correct: false,
      },
      {
        id: '30',
        value: 'По любой из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10:С какой скоростью Вы можете продолжить движение вне населенного пункта по левой полосе на легковом автомобиле?',
    link: './img/ticket__01/01__10.jpg',
    answer: [
      {
        id: '31',
        value: 'Не более 50 км/ч.',
        correct: false,
      },
      {
        id: '32',
        value: 'Не менее 50 км/ч и не более 70 км/ч.',
        correct: false,
      },
      {
        id: '33',
        value: 'Не менее 50 км/ч и не более 90 км/ч.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №11: Можно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?',
    link: './img/ticket__01/01__11.jpg',
    answer: [
      {
        id: '34',
        value: 'Можно.',
        correct: true,
      },
      {
        id: '35',
        value: 'Можно, если скорость грузовых автомобилей менее 30 км/ч.',
        correct: false,
      },
      {
        id: '36',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?',
    link: './img/ticket__01/01__12.jpg',
    answer: [
      {
        id: '37',
        value: 'Только если расстояние до сплошной линии разметки не менее 3 м.',
        correct: false,
      },
      {
        id: '38',
        value: 'Только если расстояние до края пересекаемой проезжей части не менее 5 м.',
        correct: false,
      },
      {
        id: '39',
        value: 'При соблюдении обоих перечисленных условий.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №13: При повороте направо Вы должны уступить дорогу:',
    link: './img/ticket__01/01__13.jpg',
    answer: [
      {
        id: '40',
        value: 'Только велосипедисту.',
        correct: true,
      },
      {
        id: '41',
        value: 'Только пешеходам.',
        correct: false,
      },
      {
        id: '42',
        value: 'Пешеходам и велосипедисту.',
        correct: false,
      },
      {
        id: '43',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены проехать перекресток в прямом направлении. Кому следует уступить дорогу?',
    link: './img/ticket__01/01__14.jpg',
    answer: [
      {
        id: '44',
        value: 'Обоим трамваям.',
        correct: true,
      },
      {
        id: '45',
        value: 'Только трамваю А.',
        correct: false,
      },
      {
        id: '46',
        value: 'Только трамваю Б.',
        correct: false,
      },
      {
        id: '47',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы обязаны уступить дорогу при повороте налево?',
    link: './img/ticket__01/01__15.jpg',
    answer: [
      {
        id: '48',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '49',
        value: 'Только легковому автомобилю.',
        correct: false,
      },
      {
        id: '50',
        value: 'Никому.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №16: С какой максимальной скоростью можно продолжить движение за знаком?',
    link: './img/ticket__01/01__16.jpg',
    answer: [
      {
        id: '51',
        value: '60км/ч.',
        correct: true,
      },
      {
        id: '52',
        value: '50км/ч.',
        correct: false,
      },
      {
        id: '53',
        value: '30км/ч.',
        correct: false,
      },
      {
        id: '54',
        value: '20км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №17: Для перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '55',
        value: 'Категории «A» или подкатегории «A1».',
        correct: false,
      },
      {
        id: '56',
        value: 'Любой категории или подкатегории в течение двух и более лет.',
        correct: false,
      },
      {
        id: '57',
        value: 'Только категории «A» или подкатегории «A1» в течение двух и более лет.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: При какой неисправности разрешается эксплуатация транспортного средства?',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '58',
        value: 'Не работают пробки топливных баков.',
        correct: false,
      },
      {
        id: '59',
        value: 'Не работает механизм регулировки положения сиденья водителя.',
        correct: false,
      },
      {
        id: '60',
        value: 'Не работают устройства обогрева и обдува стекол.',
        correct: false,
      },
      {
        id: '61',
        value: 'Не работает стеклоподъемник.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:',
    link: './img/ticket__01/no__picture.jpg',
    answer: [
      {
        id: '62',
        value: 'Затормозить и полностью остановиться.',
        correct: false,
      },
      {
        id: '63',
        value: 'Затормозить и плавно направить автомобиль на проезжую часть.',
        correct: false,
      },
      {
        id: '64',
        value: 'Не прибегая к торможению, плавно направить автомобиль на проезжую часть.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №20: Что понимается под временем реакции водителя?',
    link: './img/ticket__01/01__03.jpg',
    answer: [
      {
        id: '31',
        value: 'Время с момента обнаружения водителем опасности до полной остановки транспортного средства.',
        correct: false,
      },
      {
        id: '32',
        value: 'Время с момента обнаружения водителем опасности до начала принятия мер по ее избежанию.',
        correct: true,
      },
      {
        id: '33',
        value: 'Время, необходимое для переноса ноги с педали управления подачей топлива на педаль тормоза.',
        correct: false,
      },
    ]
  },
]

export default DATA;