export const DATA = [
  {
    question: 'Вопрос №1: В каких случаях владелец легкового автомобиля может передавать управление этим транспортным средством в своём присутствии другому лицу, имея страховой полис обязательного страхования гражданской ответственности на бумажном носителе или в виде электронного документа либо его копии на бумажном носителе?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '1',
        value: 'При наличии у этого лица водительского удостоверения на право управления транспортным средством подкатегории «B1».',
        correct: false,
      },
      {
        id: '2',
        value: 'При наличии у этого лица водительского удостоверения на право управления транспортным средством категории «B».',
        correct: true,
      },
      {
        id: '3',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Этот знак:',
    link: './img/12-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Предупреждает Вас о наличии узкого участка дороги, но не устанавливает очередность движения.',
        correct: false,
      },
      {
        id: '5',
        value: 'Запрещает Вам проезд через мост.',
        correct: false,
      },
      {
        id: '6',
        value: 'Обязывает Вас уступить дорогу встречному транспортному средству.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №3: В каких направлениях Вам можно продолжить движение на перекрестке?',
    link: './img/12-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только налево и в обратном направлении.',
        correct: false,
      },
      {
        id: '8',
        value: 'Прямо, налево и в обратном направлении.',
        correct: true,
      },
      {
        id: '9',
        value: 'В любом направлении.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Какие из указанных знаков разрешают движение мопедов?',
    link: './img/12-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только В.',
        correct: true,
      },
      {
        id: '11',
        value: 'Только Г.',
        correct: false,
      },
      {
        id: '12',
        value: 'Б, В и Г.',
        correct: false,
      },
      {
        id: '13',
        value: 'Все.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Движение разрешается:',
    link: './img/12-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Только по траектории А.',
        correct: false,
      },
      {
        id: '15',
        value: 'Только по траектории Б.',
        correct: true,
      },
      {
        id: '16',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Какое значение имеет сигнал свистком, подаваемый регулировщиком?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '17',
        value: 'Водитель должен немедленно остановиться.',
        correct: false,
      },
      {
        id: '18',
        value: 'Водитель должен ускорить движение.',
        correct: false,
      },
      {
        id: '19',
        value: 'Сигнал подается для привлечения внимания участников движения.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №7: Вы намерены повернуть налево на этом перекрестке. В какой момент следует включить указатели левого поворота?',
    link: './img/12-7.jpg',
    answer: [
      {
        id: '20',
        value: 'Заблаговременно, до въезда на перекресток.',
        correct: false,
      },
      {
        id: '21',
        value: 'После въезда на первое пересечение проезжих частей.',
        correct: true,
      },
      {
        id: '22',
        value: 'По Вашему усмотрению.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Кто должен уступить дорогу при одновременном перестроении?',
    link: './img/12-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Водитель легкового автомобиля.',
        correct: true,
      },
      {
        id: '24',
        value: 'Водитель мотоцикла.',
        correct: false,
      },
      {
        id: '25',
        value: 'В данной ситуации водителям следует действовать по взаимной договоренности.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Разрешено ли Вам выполнить разворот на мосту по указанной траектории?',
    link: './img/12-9.jpg',
    answer: [
      {
        id: '26',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '27',
        value: 'Разрешено только при видимости дороги не менее 100 м.',
        correct: false,
      },
      {
        id: '28',
        value: 'Запрещено.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: С какой скоростью Вы имеете право продолжить движение в населенном пункте по правой полосе?',
    link: './img/12-10.jpg',
    answer: [
      {
        id: '29',
        value: 'Не более 40 км/ч.',
        correct: false,
      },
      {
        id: '30',
        value: 'Не более 60 км/ч.',
        correct: true,
      },
      {
        id: '31',
        value: 'Не менее 40 км/ч и не более 60 км/ч.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешено ли Вам выполнить обгон в данной ситуации?',
    link: './img/12-11.jpg',
    answer: [
      {
        id: '32',
        value: 'Разрешено.',
        correct: false,
      },
      {
        id: '33',
        value: 'Разрешено, если обгон будет завершен до перекрестка.',
        correct: true,
      },
      {
        id: '34',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Можно ли Вам поставить автомобиль на стоянку в указанном месте?',
    link: './img/12-12.jpg',
    answer: [
      {
        id: '35',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '36',
        value: 'Можно, если Вы проживаете или работаете в обозначенной знаком зоне.',
        correct: false,
      },
      {
        id: '37',
        value: 'Нельзя.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены повернуть направо. Ваши действия?',
    link: './img/12-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Повернете направо, не уступая дорогу пешеходам.',
        correct: false,
      },
      {
        id: '39',
        value: 'Повернете направо, уступив дорогу пешеходам.',
        correct: true,
      },
      {
        id: '40',
        value: 'Остановитесь перед перекрестком и дождетесь другого сигнала регулировщика.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: При движении в каком направлении Вы должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным звуковым сигналом?',
    link: './img/12-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Только налево.',
        correct: false,
      },
      {
        id: '42',
        value: 'Налево и в обратном направлении.',
        correct: false,
      },
      {
        id: '43',
        value: 'В любом.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: Вы намерены продолжить движение прямо. Ваши действия при желтом мигающем сигнале светофора?',
    link: './img/12-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Уступите дорогу обоим транспортным средствам.',
        correct: false,
      },
      {
        id: '45',
        value: 'Уступите дорогу только трамваю.',
        correct: false,
      },
      {
        id: '46',
        value: 'Уступите дорогу только автомобилю.',
        correct: true,
      },
      {
        id: '47',
        value: 'Проедете первым.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Разрешается ли учебная езда на автомагистрали?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '48',
        value: '',
        correct: false,
      },
      {
        id: '49',
        value: '',
        correct: false,
      },
      {
        id: '50',
        value: '',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: При движении в темное время суток на неосвещенных участках дорог можно использовать противотуманные фары:',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '51',
        value: 'Только отдельно от ближнего или дальнего света фар.',
        correct: false,
      },
      {
        id: '52',
        value: 'Только совместно с ближним или дальним светом фар.',
        correct: true,
      },
      {
        id: '53',
        value: 'Как отдельно, так и совместно с ближним или дальним светом фар.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: При какой неисправности тормозной системы запрещается эксплуатация транспортного средства?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '54',
        value: 'Не включается контрольная лампа стояночной тормозной системы.',
        correct: false,
      },
      {
        id: '55',
        value: 'Стояночная тормозная система не обеспечивает неподвижное состояние транспортного средства с полной нагрузкой на уклоне до 16 % включительно.',
        correct: true,
      },
      {
        id: '56',
        value: 'Уменьшен свободный ход педали тормоза.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: Способ разворота с использованием прилегающей территории справа, обеспечивающий безопасность движения, показан:',
    link: './img/12-19.jpg',
    answer: [
      {
        id: '57',
        value: 'Только на левом рисунке.',
        correct: true,
      },
      {
        id: '58',
        value: 'Только на правом рисунке.',
        correct: false,
      },
      {
        id: '59',
        value: 'На обоих рисунках.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Как следует уложить пострадавшего при потере им сознания и наличии дыхания и кровообращения для оказания первой помощи?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '60',
        value: 'На спину с подложенным под голову валиком.',
        correct: false,
      },
      {
        id: '61',
        value: 'На спину с вытянутыми ногами.',
        correct: false,
      },
      {
        id: '62',
        value: 'Придать пострадавшему устойчивое боковое положение, чтобы согнутые колени опирались о землю, а верхняя рука находилась под щекой.',
        correct: true,
      },
    ]
  },
]

export default DATA;