export const DATA = [
  {
    question: 'Вопрос №1: Выезжая с грунтовой дороги на перекресток, Вы попадаете:',
    link: './img/3-1.jpg',
    answer: [
      {
        id: '1',
        value: 'На главную дорогу.',
        correct: true,
      },
      {
        id: '2',
        value: 'На равнозначную дорогу, поскольку отсутствуют знаки приоритета.',
        correct: false,
      },
      {
        id: '3',
        value: 'На равнозначную дорогу, поскольку проезжая часть имеет твердое покрытие перед перекрестком.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Где Вы должны остановиться?',
    link: './img/3-2.jpg',
    answer: [
      {
        id: '4',
        value: 'Перед знаком (А).',
        correct: false,
      },
      {
        id: '5',
        value: 'Перед перекрестком (Б).',
        correct: false,
      },
      {
        id: '6',
        value: 'Перед краем пересекаемой проезжей части (В).',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №3: Вам необходимо двигаться со скоростью не более 40 км/ч:',
    link: './img/3-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только во время дождя.',
        correct: false,
      },
      {
        id: '8',
        value: 'Во время выпадения осадков (дождя, града, снега).',
        correct: false,
      },
      {
        id: '9',
        value: 'Во всех случаях, когда покрытие проезжей части влажное.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №4: Какой из указанных знаков устанавливается в начале дороги с односторонним движением?',
    link: './img/3-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только А.',
        correct: false,
      },
      {
        id: '11',
        value: 'Только Б.',
        correct: true,
      },
      {
        id: '12',
        value: 'Б или Г',
        correct: false,
      },
      {
        id: '13',
        value: 'Б или В',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Можно ли Вам остановиться в этом месте для посадки или высадки пассажиров?',
    link: './img/3-5.jpg',
    answer: [
      {
        id: '14',
        value: 'Можно.',
        correct: false,
      },
      {
        id: '15',
        value: 'Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств.',
        correct: true,
      },
      {
        id: '16',
        value: 'Нельзя.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: При повороте направо Вы:',
    link: './img/3-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Имеете право проехать перекресток первым.',
        correct: false,
      },
      {
        id: '17',
        value: 'Должны уступить дорогу только пешеходам.',
        correct: false,
      },
      {
        id: '18',
        value: 'Должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным звуковым сигналом, а также пешеходам.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №7: В каких случаях водитель не должен подавать сигнал указателями поворота?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '19',
        value: 'Только при отсутствии на дороге других участников движения.',
        correct: false,
      },
      {
        id: '20',
        value: 'Только если сигнал может ввести в заблуждение других участников движения.',
        correct: true,
      },
      {
        id: '21',
        value: 'В обоих перечисленных случаях.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Вам разрешено выполнить поворот направо:',
    link: './img/3-8.jpg',
    answer: [
      {
        id: '22',
        value: 'Только по траектории А.',
        correct: true,
      },
      {
        id: '23',
        value: 'Только по траектории Б.',
        correct: false,
      },
      {
        id: '24',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №9: Разрешается ли Вам выполнить разворот на перекрестке по указанной траектории?',
    link: './img/3-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '26',
        value: 'Разрешается, если видимость дороги не менее 100 м.',
        correct: false,
      },
      {
        id: '27',
        value: 'Запрещается.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №10: По какой полосе Вы имеете право двигаться с максимально разрешенной скоростью вне населенных пунктов?',
    link: './img/3-10.jpg',
    answer: [
      {
        id: '28',
        value: 'Только по правой.',
        correct: true,
      },
      {
        id: '29',
        value: 'Только по левой.',
        correct: false,
      },
      {
        id: '30',
        value: 'По любой.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: В каком случае водитель может начать обгон, если такой маневр на данном участке дороги не запрещен?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '31',
        value: 'Только если полоса, предназначенная для встречного движения, свободна на достаточном для обгона расстоянии.',
        correct: false,
      },
      {
        id: '32',
        value: 'Только если его транспортное средство никто не обгоняет.',
        correct: true,
      },
      {
        id: '33',
        value: 'В случае, если выполнены оба условия.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Кто из водителей нарушил правила стоянки?',
    link: './img/3-12.jpg',
    answer: [
      {
        id: '34',
        value: 'Оба.',
        correct: false,
      },
      {
        id: '35',
        value: 'Только водитель автомобиля.',
        correct: true,
      },
      {
        id: '36',
        value: 'Только водитель мотоцикла.',
        correct: false,
      },
      {
        id: '37',
        value: 'Никто не нарушил.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: При движении прямо Вы:',
    link: './img/3-13.jpg',
    answer: [
      {
        id: '38',
        value: 'Должны остановиться перед стоп-линией.',
        correct: false,
      },
      {
        id: '39',
        value: 'Можете продолжить движение через перекресток без остановки.',
        correct: true,
      },
      {
        id: '40',
        value: 'Должны уступить дорогу транспортным средствам, движущимся с других направлений.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Вы намерены повернуть направо. Ваши действия?',
    link: './img/3-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Проедете перекресток первым.',
        correct: true,
      },
      {
        id: '42',
        value: 'Уступите дорогу легковому автомобилю.',
        correct: false,
      },
      {
        id: '43',
        value: 'Уступите дорогу обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №15: Кому Вы обязаны уступить дорогу при повороте налево?',
    link: './img/3-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Трамваям А и Б.',
        correct: false,
      },
      {
        id: '45',
        value: 'Трамваю А и легковому автомобилю.',
        correct: false,
      },
      {
        id: '46',
        value: 'Только трамваю А.',
        correct: true,
      },
      {
        id: '47',
        value: 'Никому.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Кто из водителей нарушил правила остановки?',
    link: './img/3-16.jpg',
    answer: [
      {
        id: '47',
        value: 'Только водитель легкового автомобиля.',
        correct: false,
      },
      {
        id: '48',
        value: 'Только водитель грузового автомобиля.',
        correct: false,
      },
      {
        id: '49',
        value: 'Оба.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: Какое оборудование должно иметь механическое транспортное средство, используемое для обучения вождению?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '50',
        value: 'Дополнительные педали привода сцепления (кроме транспортных средств с автоматической трансмиссией) и тормоза.',
        correct: false,
      },
      {
        id: '51',
        value: 'Зеркало заднего вида для обучающего вождению.',
        correct: false,
      },
      {
        id: '52',
        value: 'Опознавательные знаки «Учебное транспортное средство».',
        correct: false,
      },
      {
        id: '53',
        value: 'Все перечисленное оборудование.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №18: Какие из перечисленных транспортных средств разрешается эксплуатировать без огнетушителя?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '54',
        value: 'Только мотоциклы без бокового прицепа.',
        correct: false,
      },
      {
        id: '55',
        value: 'Любые мотоциклы.',
        correct: true,
      },
      {
        id: '56',
        value: 'Все мотоциклы и легковые автомобили.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №19: На повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '57',
        value: 'Уменьшите подачу топлива, рулевым колесом стабилизируете движение.',
        correct: false,
      },
      {
        id: '58',
        value: 'Притормозите и повернете рулевое колесо в сторону заноса.',
        correct: false,
      },
      {
        id: '59',
        value: 'Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом.',
        correct: true,
      },
      {
        id: '60',
        value: 'Значительно увеличите подачу топлива, не меняя положения рулевого колеса.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Какие сведения необходимо сообщить диспетчеру для вызова скорой медицинской помощи при дорожно-транспортном происшествии (ДТП)?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '61',
        value: 'Указать общеизвестные ориентиры, ближайшие к месту ДТП. Сообщить о количестве пострадавших, указать их пол и возраст.',
        correct: false,
      },
      {
        id: '62',
        value: 'Указать улицу и номер дома, ближайшего к месту ДТП. Сообщить, кто пострадал в ДТП (пешеход, водитель автомобиля или пассажиры), и описать травмы, которые они получили.',
        correct: false,
      },
      {
        id: '63',
        value: 'Указать место ДТП (назвать улицу, номер дома и общеизвестные ориентиры, ближайшие к месту ДТП). Сообщить: количество пострадавших, их пол, примерный возраст, наличие у них сознания, дыхания, кровообращения, а также сильного кровотечения, переломов и других травм. Дождаться сообщения диспетчера о том, что вызов принят.',
        correct: true,
      },
    ]
  },
]

export default DATA;