export const DATA = [
  {
    question: 'Вопрос №1: Сколько полос для движения имеет проезжая часть данной дороги?',
    link: './img/4-1.jpg',
    answer: [
      {
        id: '1',
        value: 'Одну полосу.',
        correct: false,
      },
      {
        id: '2',
        value: 'Две полосы.',
        correct: true,
      },
      {
        id: '3',
        value: 'Три полосы.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №2: Эти знаки предупреждают Вас:',
    link: './img/4-2.jpg',
    answer: [
      {
        id: '4',
        value: 'О наличии через 500 м опасных поворотов.',
        correct: false,
      },
      {
        id: '5',
        value: 'О том, что на расстоянии 150 - 300 м за дорожным знаком начнется участок дороги протяженностью 500 м с опасными поворотами.',
        correct: true,
      },
      {
        id: '6',
        value: 'О том, что сразу за знаком начнется участок протяженностью 500 м с опасными поворотами.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №3: Какой из указанных знаков распространяет свое действие только на ту полосу, над которой он установлен?',
    link: './img/4-3.jpg',
    answer: [
      {
        id: '7',
        value: 'Только А.',
        correct: true,
      },
      {
        id: '8',
        value: 'Только Б.',
        correct: false,
      },
      {
        id: '9',
        value: 'Б и В.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №4: Вы буксируете неисправный автомобиль. По какой полосе Вам можно продолжить движение в населенном пункте?',
    link: './img/4-4.jpg',
    answer: [
      {
        id: '10',
        value: 'Только по правой.',
        correct: true,
      },
      {
        id: '11',
        value: 'Только по левой.',
        correct: false,
      },
      {
        id: '12',
        value: 'По любой.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №5: Что означает разметка в виде надписи «СТОП» на проезжей части?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '13',
        value: 'Предупреждает о приближении к стоп-линии перед регулируемым перекрестком.',
        correct: false,
      },
      {
        id: '14',
        value: 'Предупреждает о приближении к стоп-линии и знаку «Движение без остановки запрещено».',
        correct: true,
      },
      {
        id: '15',
        value: 'Предупреждает о приближении к знаку «Уступите дорогу».',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №6: Каким транспортным средствам разрешено движение прямо?',
    link: './img/4-6.jpg',
    answer: [
      {
        id: '16',
        value: 'Только грузовому автомобилю.',
        correct: true,
      },
      {
        id: '17',
        value: 'Легковому и грузовому автомобилям.',
        correct: false,
      },
      {
        id: '18',
        value: 'Грузовому автомобилю и автобусу.',
        correct: false,
      },
      {
        id: '19',
        value: 'Всем перечисленным транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №7: Вы намерены продолжить движение по главной дороге. Обязаны ли Вы при этом включить указатели правого поворота?',
    link: './img/4-7.jpg',
    answer: [
      {
        id: '20',
        value: 'Обязаны.',
        correct: true,
      },
      {
        id: '21',
        value: 'Обязаны только при наличии движущегося сзади транспортного средства.',
        correct: false,
      },
      {
        id: '22',
        value: 'Не обязаны.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №8: Кто должен уступить дорогу?',
    link: './img/4-8.jpg',
    answer: [
      {
        id: '23',
        value: 'Водитель грузового автомобиля.',
        correct: false,
      },
      {
        id: '24',
        value: 'Водитель легкового автомобиля.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №9: Вам можно выполнить разворот:',
    link: './img/4-9.jpg',
    answer: [
      {
        id: '25',
        value: 'Только по траектории А.',
        correct: false,
      },
      {
        id: '26',
        value: 'Только по траектории Б.',
        correct: true,
      },
      {
        id: '27',
        value: 'По любой траектории из указанных.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №10: По какой полосе проезжей части разрешено движение в населенном пункте, если по техническим причинам транспортное средство не может развивать скорость более 40 км/ч?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '28',
        value: 'Только по крайней правой.',
        correct: true,
      },
      {
        id: '29',
        value: 'Не далее второй полосы.',
        correct: false,
      },
      {
        id: '30',
        value: 'По любой, кроме крайней левой.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №11: Разрешено ли Вам обогнать мотоцикл?',
    link: './img/4-11.jpg',
    answer: [
      {
        id: '31',
        value: 'Разрешено.',
        correct: true,
      },
      {
        id: '32',
        value: 'Разрешено только после проезда перекрестка.',
        correct: false,
      },
      {
        id: '33',
        value: 'Запрещено.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №12: Разрешается ли Вам остановка для посадки пассажира в этом месте?',
    link: './img/4-12.jpg',
    answer: [
      {
        id: '34',
        value: 'Разрешается.',
        correct: false,
      },
      {
        id: '35',
        value: 'Разрешается, если при этом не будут созданы помехи для движения маршрутных транспортных средств.',
        correct: true,
      },
      {
        id: '36',
        value: 'Запрещается.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №13: Вы намерены проехать перекресток в прямом направлении. Ваши действия?',
    link: './img/4-13.jpg',
    answer: [
      {
        id: '37',
        value: 'Проедете перекресток первым.',
        correct: false,
      },
      {
        id: '38',
        value: 'Уступите дорогу только встречному автомобилю.',
        correct: false,
      },
      {
        id: '39',
        value: 'Уступите дорогу только автомобилю с включенными проблесковым маячком и специальным звуковым сигналом.',
        correct: true,
      },
      {
        id: '40',
        value: 'Уступите дорогу обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №14: Кому Вы должны уступить дорогу при повороте направо?',
    link: './img/4-14.jpg',
    answer: [
      {
        id: '41',
        value: 'Только пешеходу, переходящему проезжую часть по нерегулируемому пешеходному переходу.',
        correct: false,
      },
      {
        id: '42',
        value: 'Только пешеходам, переходящим проезжую часть, на которую Вы поворачиваете.',
        correct: false,
      },
      {
        id: '43',
        value: 'Всем пешеходам.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №15: Как Вам следует поступить при выполнении разворота?',
    link: './img/4-15.jpg',
    answer: [
      {
        id: '44',
        value: 'Проехать перекресток первым.',
        correct: false,
      },
      {
        id: '45',
        value: 'Уступить дорогу только легковому автомобилю.',
        correct: true,
      },
      {
        id: '46',
        value: 'Уступить дорогу обоим транспортным средствам.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №16: Какие из перечисленных действий запрещены водителям механических транспортных средств в жилой зоне?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '47',
        value: 'Сквозное движение.',
        correct: false,
      },
      {
        id: '48',
        value: 'Учебная езда.',
        correct: false,
      },
      {
        id: '49',
        value: 'Стоянка с работающим двигателем.',
        correct: false,
      },
      {
        id: '50',
        value: 'Все перечисленные действия.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №17: Какое расстояние должно быть обеспечено между буксирующим и буксируемым транспортными средствами при буксировке на жесткой сцепке?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '51',
        value: 'Не более 4 м.',
        correct: true,
      },
      {
        id: '52',
        value: 'От 4 до 6 м.',
        correct: false,
      },
      {
        id: '53',
        value: 'От 6 до 8 м.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №18: В каком случае разрешается эксплуатация транспортного средства?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '54',
        value: 'Загрязнены внешние световые приборы.',
        correct: false,
      },
      {
        id: '55',
        value: 'Регулировка фар не соответствует установленным требованиям.',
        correct: false,
      },
      {
        id: '56',
        value: 'На световых приборах используются рассеиватели и лампы, не соответствующие типу данного светового прибора.',
        correct: false,
      },
      {
        id: '57',
        value: 'На световых приборах используются рассеиватели и лампы, не соответствующие типу данного светового прибора.',
        correct: true,
      },
    ]
  },
  {
    question: 'Вопрос №19: Что следует предпринять водителю для предотвращения опасных последствий заноса автомобиля при резком повороте рулевого колеса на скользкой дороге?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '58',
        value: 'Быстро, но плавно повернуть рулевое колесо в сторону заноса, затем опережающим воздействием на рулевое колесо выровнять траекторию движения.',
        correct: true,
      },
      {
        id: '59',
        value: 'Выключить сцепление и повернуть рулевое колесо в сторону заноса.',
        correct: false,
      },
      {
        id: '60',
        value: 'Нажать на педаль тормоза и воздействием на рулевое колесо выровнять траекторию движения.',
        correct: false,
      },
    ]
  },
  {
    question: 'Вопрос №20: Как следует расположить руки на грудной клетке пострадавшего при проведении сердечно-легочной реанимации?',
    link: './img/0-0.jpg',
    answer: [
      {
        id: '61',
        value: 'Основания ладоней обеих кистей, взятых в «замок», должны располагаться на грудной клетке на два пальца выше мечевидного отростка так, чтобы большой палец одной руки указывал в сторону левого плеча пострадавшего, а другой – в сторону правого плеча. Руки выпрямляются в локтевых суставах.',
        correct: false,
      },
      {
        id: '62',
        value: 'Основание ладони одной руки накладывают на середину грудной клетки на два пальца выше мечевидного отростка, вторую руку накладывают сверху, пальцы рук берут в замок. Руки выпрямляются в локтевых суставах, большие пальцы рук указывают на подбородок и живот. Надавливания должны проводиться без резких движений.',
        correct: true,
      },
      {
        id: '63',
        value: 'Давление руками на грудину выполняют основанием ладони одной руки, расположенной на грудной клетке на два пальца выше мечевидного отростка. Рука выпрямлена в локтевом суставе. Направление большого пальца не имеет значения.',
        correct: false,
      },
    ]
  },
]

export default DATA;